{"meta":{"title":"JingyuJung's Blog","subtitle":null,"description":null,"author":"Jingyu Jung","url":"http://monibu1548.github.io"},"pages":[],"posts":[{"title":"iOS앱 고도화 - Firebase Remote Config를 사용한 앱 운영방법","slug":"firebase-config","date":"2018-05-14T12:14:04.000Z","updated":"2018-05-14T13:32:52.564Z","comments":true,"path":"2018/05/14/firebase-config/","link":"","permalink":"http://monibu1548.github.io/2018/05/14/firebase-config/","excerpt":"Firebase Remote Config Firebase Remote Config란, 앱 업데이트를 게시하지 않고도 앱의 동작과 모양을 변경할 수 있도록 도와주는 서비스입니다. 앱의 실행시점에 서버에서 Config를 읽어오는 비교적 쉬운 개념이지만. 이를 활용해서 다양한 응용동작을 할 수 있습니다. 비슷한 서비스로는 NHN Entertainment의 Toast Cloud - Launching이 있습니다. 1. 최신 업데이트 버전을 가져와 현재 설치된 버전과 비교하여 업데이트를 유도할 수 있습니다. 2. 공지사항 팝업을 띄울","text":"Firebase Remote ConfigFirebase Remote Config란, 앱 업데이트를 게시하지 않고도 앱의 동작과 모양을 변경할 수 있도록 도와주는 서비스입니다. 앱의 실행시점에 서버에서 Config를 읽어오는 비교적 쉬운 개념이지만. 이를 활용해서 다양한 응용동작을 할 수 있습니다. 비슷한 서비스로는 NHN Entertainment의 Toast Cloud - Launching이 있습니다. 최신 업데이트 버전을 가져와 현재 설치된 버전과 비교하여 업데이트를 유도할 수 있습니다. 공지사항 팝업을 띄울 수 있습니다. Color 값을 전달하면 앱의 전반전인 테마 컬러 변경이 가능합니다. static한 문구들 (연도, 전화번호)을 변경할 때 앱을 새로 빌드할 필요가 없습니다. 이 기능을 구현하려면 Config 정보를 내려줄 서버가 필요합니다. 하지만 단일 앱 개발자에게 서버는 사치죠ㅜㅠ 고맙게도 Google의 Firebase에서 이러한 기능을 제공합니다. Remote Config 라는 이름으로 위 기능을 제공하고 있습니다. Firebase 시작하기Google Firebase 홈페이지 프로젝트 생성 후 Remote Config 시작하기를 클릭합니다. 이제 매개변수를 설정할 수 있습니다. 버전, 광고 실행 유무 등, 앱애서 사용할 매개변수들을 추가합니다. 변경사항 개시 버튼을 클릭하여 해당 내용을 배포합니다. iOS에서 Firebase Remote Config 설정하기공식 가이드 문서 링크 GoogleService-Info.plistiOS앱에서 Firebase에 연결하기 위해서는 GoogleService-Info.plist 가 필요하며. 이 파일은 Firebase에서 제공합니다. Firebase에서 프로젝트를 생성합니다. 프로젝트에서 사용하고있는 Firebase 서비스의 정보를 담긴 GoogleService-Info.plist를 다운받습니다.나중에 Cloude Message 등 다른 추가기능 사용을 선택하면 GoogleService-Info.plist 업데이트도 필요합니다. Pod 설치1pod &apos;Firebase/RemoteConfig&apos; Podfile에 추가 후 설치합니다. AppDelegate 설정1import Firebase/RemoteConfig 사용하고 있는 AppDelegate에 RemoteConfig 모듈을 추가합니다. 1234func application(_ application: UIApplication, didFinishLaunchingWithOptions launchOptions: [UIApplicationLaunchOptionsKey: Any]?) -&gt; Bool &#123; FirebaseApp.configure() return true &#125; didFinishLaunchingWithOptions 메소드에 Firebase.configure()를 추가하여 공유 인스턴스를 구성합니다. fetch 과정을 통해 Firebase에 등록했던 매개변수들이 정상적으로 내려오는지 확인해봅니다.","categories":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/categories/iOS/"}],"tags":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/tags/iOS/"},{"name":"Firebase","slug":"Firebase","permalink":"http://monibu1548.github.io/tags/Firebase/"},{"name":"앱 고도화","slug":"앱-고도화","permalink":"http://monibu1548.github.io/tags/앱-고도화/"}]},{"title":"Storyboard autolayout 환경에서 Keyboard Event로 Height 처리하기","slug":"keyboard-autolayout-event","date":"2018-05-13T15:03:38.000Z","updated":"2018-05-13T15:35:21.217Z","comments":true,"path":"2018/05/14/keyboard-autolayout-event/","link":"","permalink":"http://monibu1548.github.io/2018/05/14/keyboard-autolayout-event/","excerpt":"Text Input이 필요한 화면에서 고려할점 TextView 또는 TextField를 이용해 사용자로부터 텍스트를 입력받는 화면에서는 키보드가 나타납니다. 키보드가 나타나면 그만큼 컨텐츠를 보여줄 수 있는 화면의 Height는 줄어들게 되고 그 중 일부는 키보드 밑으로 말려들어가 보이지 않게 되는 문제가 생길 수 있습니다. 따라서 키보드가 나타날 때 아래의 뷰를 키보드 위로 올려주는 구현이 필요합니다. 왜 키보드는 Autolayout Bottom Layout에 걸리지 않는가… 스토리보드와 오토레이아웃을 사용하면서 iOS 11 이","text":"Text Input이 필요한 화면에서 고려할점TextView 또는 TextField를 이용해 사용자로부터 텍스트를 입력받는 화면에서는 키보드가 나타납니다.키보드가 나타나면 그만큼 컨텐츠를 보여줄 수 있는 화면의 Height는 줄어들게 되고 그 중 일부는 키보드 밑으로 말려들어가 보이지 않게 되는 문제가 생길 수 있습니다.따라서 키보드가 나타날 때 아래의 뷰를 키보드 위로 올려주는 구현이 필요합니다. 왜 키보드는 Autolayout Bottom Layout에 걸리지 않는가…스토리보드와 오토레이아웃을 사용하면서 iOS 11 이후 등장한 SafeArea에 대한 대응이 편해졌습니다.처음에는 당연히 키보드가 나타날 때 Bottom Layout Guide가 올라오면서 자동으로 대응이 될 거라고 생각했지만…. 중요한 문구, 버튼들이 키보드 밑으로 말려들어가는 대참사가 발생했습니다. Notification과 Autolayout을 이용해 간단하게 해결iOS가 오토레이아웃을 해주지 않는다면 Keyboard 사이즈의 View를 직접 넣어 Autolayout으로 동작하게 만들고,Notification을 이용해 keyboard 상태를 받아 Keyboard layout을 대신하는 View의 Height를 조작함으로써 수정했습니다. Keyboard가 나타날 수 있는 ViewController의 가장 하단에 View를 하나 끼워넣습니다.이 View는 키보드의 show, dismiss 동일한 타이밍, 사이즈로 동작하게 만들겁니다. Contraint를 이용해 topAnchor를 기존에 가장 하단에 있던 뷰의 bottomAnchor에 연결하고, bottomAnchor는 viewController의 root view의 bottom layout guide에 연결해줍니다.그리고 height는 키보드와 동일한 값을 갖게 할거고 초기값은 0으로 설정해줍니다.(키보드 없는상태) 이제 Notification을 이용해 이 View의 height를 조절하면 됩니다. Keyboard Notification Register12345678910111213141516171819202122232425extension TranslationViewController &#123; private func initializeKeyboardEvent() &#123; NotificationCenter.default.addObserver(self, selector: #selector(keyBoardWillShow(notification:)), name: .UIKeyboardWillShow, object: nil) NotificationCenter.default.addObserver(self, selector: #selector(keyBoardWillHide(notification:)), name: .UIKeyboardWillHide, object: nil) &#125; private func removeKeyboardEvent() &#123; NotificationCenter.default.removeObserver(self) &#125; @objc func keyBoardWillShow(notification: NSNotification) &#123; let userInfo:NSDictionary = notification.userInfo! as NSDictionary let keyboardFrame:NSValue = userInfo.value(forKey: UIKeyboardFrameEndUserInfoKey) as! NSValue let keyboardRectangle = keyboardFrame.cgRectValue let keyboardHeight = keyboardRectangle.height self.keyboardHeightConstraint.constant = keyboardHeight &#125; @objc func keyBoardWillHide(notification: NSNotification) &#123; self.keyboardHeightConstraint.constant = 0 &#125;&#125; 위 코드는 Keyboard Notification 관련 로직을 처리하기 위해 extension으로 분리한 controller입니다. initializeKeyboardEvent : Keyboard의 Show, Hide 이벤트를 받기위해 Notification Center에 옵저버를 등록합니다. keyBoardWillShow : Keyboard가 나타날때 호출되며 notification 객체에서 keyboard height 가져올 수 있습니다. keyBoardWillHide : Keyboard가 사라질때 호출됩니다. removeKeyboardEvent : Notification을 더 이상 사용하지 않을 때 옵저버를 제거합니다. 1234567891011class TranslationViewController: UIViewController &#123; override func viewDidLoad() &#123; super.viewDidLoad() self.initializeKeyboardEvent() &#125; deinit &#123; self.removeKeyboardEvent() &#125;&#125; extension에서 구현했던 Nofitication관련 메소드들을 호출하는 메인 뷰컨트롤러입니다. 키보드를 사용하는 뷰 컨트롤러가 많지는 않지만, 추가될 때마다 이 작업을 계속해야 할 텐데, 아예 상속받을 뷰 컨트롤러을 하나 만들어 주는 것도 좋을 것 같습니다.","categories":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/categories/iOS/"}],"tags":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/tags/iOS/"},{"name":"오토레이아웃","slug":"오토레이아웃","permalink":"http://monibu1548.github.io/tags/오토레이아웃/"}]},{"title":"[Swift] Date to String, Date <=> String 객체간 변환","slug":"string-date-convert","date":"2018-05-13T11:05:40.000Z","updated":"2018-05-13T11:18:55.431Z","comments":true,"path":"2018/05/13/string-date-convert/","link":"","permalink":"http://monibu1548.github.io/2018/05/13/string-date-convert/","excerpt":"String과 Date의 객체간 변환 Date와 String의 변환은 매우 자주 사용하면서도 할 때마다 뭐였지 하고 다시 찾아보곤 합니다. 또 Obj-C만 사용하다가 Swift로 넘어오면서 한번 정리하고 갑니다. 참고로 swift4 입니다 String -> Date 1 2 3 4 5 6 7 8 9 let dateString:String = \"2018-05-13 15:05:40\" let dateFormatter = DateFormatter() dateFormatter.dateFormat = \"yyyy-MM-dd HH:mm:","text":"String과 Date의 객체간 변환Date와 String의 변환은 매우 자주 사용하면서도 할 때마다 뭐였지 하고 다시 찾아보곤 합니다.또 Obj-C만 사용하다가 Swift로 넘어오면서 한번 정리하고 갑니다. 참고로 swift4 입니다 String -&gt; Date123456789let dateString:String = \"2018-05-13 15:05:40\"let dateFormatter = DateFormatter()dateFormatter.dateFormat = \"yyyy-MM-dd HH:mm:ss\"dateFormatter.timeZone = NSTimeZone(name: \"UTC\") as TimeZone?let date:Date = dateFormatter.date(from: dateString)! Obj-C 와 마찬가지로 DateFormatter를 이용합니다.DateFormatter에 날짜 형식화 타임존을 설정 후 String을 dateFormatter의 date 메소드를 이용해 변환합니다. Date -&gt; String123456let date:Date = Date()let dateFormatter = DateFormatter()dateFormatter.dateFormat = \"yyyy-MM-dd HH:mm:ss\"let dateString:Date dateFormatter.string(from: date) DateFormatter의 string 메소드를 사용하여 변환 가능합니다.","categories":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/categories/iOS/"},{"name":"Swift","slug":"iOS/Swift","permalink":"http://monibu1548.github.io/categories/iOS/Swift/"}],"tags":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/tags/iOS/"},{"name":"Swift","slug":"Swift","permalink":"http://monibu1548.github.io/tags/Swift/"},{"name":"스위프트","slug":"스위프트","permalink":"http://monibu1548.github.io/tags/스위프트/"}]},{"title":"[Swift] Optional이란? 옵셔널 이해하기","slug":"swift-optional","date":"2018-05-12T06:41:46.000Z","updated":"2018-05-12T08:33:21.252Z","comments":true,"path":"2018/05/12/swift-optional/","link":"","permalink":"http://monibu1548.github.io/2018/05/12/swift-optional/","excerpt":"Optional Swift가 갖는 Optional이라는 개념은 변수의 값이 nil일 수 있다는 것을 표현하는 건데요, 반대로 Optional이 아니라면(non-optional) 해당 값은 nil이 될 수 없음을 의미합니다. Objective-C를 사용해왔다면 Optional이라는 표현이 너무나도 당연해보일 수 있지만, Swift에서는 Optional은 말 그대로 옵션(선택적) 이며 기본값은 non-Optional 입니다. 선언 Optional 변수의 선언은 ? 키워드를 사용합니다 1 var name: String? Op","text":"OptionalSwift가 갖는 Optional이라는 개념은 변수의 값이 nil일 수 있다는 것을 표현하는 건데요, 반대로 Optional이 아니라면(non-optional) 해당 값은 nil이 될 수 없음을 의미합니다. Objective-C를 사용해왔다면 Optional이라는 표현이 너무나도 당연해보일 수 있지만, Swift에서는 Optional은 말 그대로 옵션(선택적) 이며 기본값은 non-Optional 입니다. 선언Optional 변수의 선언은 ? 키워드를 사용합니다1var name: String? Optional의 디폴트 값은 nil로 name은 nil을 갖게 됩니다. 12var name: String // 컴파일에러var name = nil // 컴파일에러 만약 Optional 키워드를 사용하지 않았다면 값을 입력하라는 에러가 발생하고, 그 이후에라도 nil을 넣으려하면 컴파일에러가 발생합니다.여기에서 Swift가 기본적으로 non-optional을 지원하면서 갖는 엄청난 장점을 느낄 수 있습니다.nil에 대한 컴파일 에러를 통해 개발자는 nil에 대해 명확한 예외처리가 강제되며, 런타임에 nil로 인한 문제를 컴파일 단계에서 예방할 수 있습니다. 그래서 Swift가 잠재적 오류에 대해 안전하다고 표현하는 글도 많이 있습니다. Optional 변수의 이용Optional변수는 nil을 가질 수 있는 특별한 변수입니다. Optional 변수를 이용해서 작업할 때 Optional을 해제하는 과정이 추가적으로 필요합니다.1234var number1:Int? = 20var number2:Int = 100number1 + number2 Int(optional)와 Int(non-optional)의 연산을 시도하면Value of optional type &#39;Int?&#39; not unwrapped; did you mean to use &#39;!&#39; or &#39;?&#39;? 위 컴파일 에러가 발생합니다.number1은 Optional로 nil값을 가질 가능성이 있기 때문에 컴파일 단계에서 에러를 발생시킵니다. 연산을 수행하기 위해서는 unwrapping 또는 binding 과정이 필요합니다. Optional Unwrapping (옵셔널 해제)Optional Unwrapping이란 Optional 변수에서 Optional 껍데기를 벗겨내는 작업입니다. 123456var number1:Int? = 20var number2:Int = 100if number1 &#123; let sum = number1! + number1!&#125; if 로 optional 변수의 값이 nil이 아닌지 판별 후 ! unwrapping 키워드를 통해 강제로 값을 꺼내옵니다. 만약 if로 nil 체크를 하지 않고 !을 사용한다면 런타임 오류가 발생할 수 있습니다. Optional Binding (옵셔널 바인딩)12345var number1:Int? = 20var number2:Int = 100if let nonOptionalNumber1 = number1 &#123; let sum = nonOptionalNumber1 + number2 Optional Unwrapping과 비슷하지만 Optional 값을 새로운 상수로 받고, 그 이후로 non-optional값을 사용한다는 차이점이 있다.새로 선언된 nonOptionalNumber1은 이미 non-optional로 연산에 사용할 때 ! 키워드를 사용할 필요가 없다. Optional Chaining (옵셔널 체이닝)여러 객체를 혼합해서 사용하다보면 Optional끼리의 연산이 필요한 경우가 있습니다. 이 경우에 객체마다 옵셔널 바인딩을 사용하게 되면, if문이 꽤나 복잡해지겠죠Optional Chaining을 통해서 좀 더 간단하게 Optional 예외처리를 할 수 있습니다. swift에서 . 을 통해 클래스의 프로퍼티에 접근이 가능합다는 점을 이용합니다. 1234567class A &#123; var b:B?&#125;class B &#123; var c:String?&#125; 이 경우 A의 프로퍼티 b의 c에 접근할 때, b에대한 옵셔널, c에대한 옵셔널, 2번의 바인딩이 필요합니다.이 경우에 옵셔널 체이닝을 통해 한줄로 옵셔널 바인딩이 가능합니다. 123var a:A = A()if a.b?.c &#123;&#125; a.b?.c 를 통해 b의 옵셔널, c의 옵셔널 바인딩을 모두 처리가능합니다. Optional이 점점 불편해 보이는데 왜 사용할까?Objective-C에는 아직 nil타입이 존재하며 하나의 프로젝트에서 obj-c와 swift를 혼용해서 사용할 수 있습니다. 따라서 obj-c와의 상호운용성을 위해 사용합니다.","categories":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/categories/iOS/"},{"name":"Swift","slug":"iOS/Swift","permalink":"http://monibu1548.github.io/categories/iOS/Swift/"}],"tags":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/tags/iOS/"},{"name":"Swift","slug":"Swift","permalink":"http://monibu1548.github.io/tags/Swift/"},{"name":"스위프트","slug":"스위프트","permalink":"http://monibu1548.github.io/tags/스위프트/"}]},{"title":"iOS 앱에서 광고 수익 얻기 (Admob 애드몹 설치, 부착)","slug":"ios-admob","date":"2018-05-05T18:30:43.000Z","updated":"2018-05-05T19:08:15.995Z","comments":true,"path":"2018/05/06/ios-admob/","link":"","permalink":"http://monibu1548.github.io/2018/05/06/ios-admob/","excerpt":"앱을 다 만들었다면 수익에 도전해보자 모바일 어플리케이션에 광고를 부착할 수 있는 다양한 플랫폼이 있다. 그중에서도 Google의 Admob을 이용한 방법을 소개합니다. Admob 가입하기 https://www.google.co.kr/admob 구글 애드몹 페이지 구글 계정으로 로그인 할 수 있습니다. 광고 생성하기 우선 애드몹 페이지에서 광고를 붙일 앱을 설정합니다. 앱 추가 버튼을 통해 추가할 수 있습니다. 광고를 부착할 앱이 기존에 스토어에 등록되어있던 앱인지, 새로 만들 앱인지 선택합니다. 저는 아직 스토어에 업로드","text":"앱을 다 만들었다면 수익에 도전해보자모바일 어플리케이션에 광고를 부착할 수 있는 다양한 플랫폼이 있다. 그중에서도 Google의 Admob을 이용한 방법을 소개합니다. Admob 가입하기https://www.google.co.kr/admob 구글 애드몹 페이지 구글 계정으로 로그인 할 수 있습니다. 광고 생성하기우선 애드몹 페이지에서 광고를 붙일 앱을 설정합니다. 앱 추가 버튼을 통해 추가할 수 있습니다. 광고를 부착할 앱이 기존에 스토어에 등록되어있던 앱인지, 새로 만들 앱인지 선택합니다. 저는 아직 스토어에 업로드 하지 않아서 아니요를 선택했습니다. 앱의 이름(스토어에 노출되는 이름은 아니고, Admob에서 구분하기 위한 별명같은 용도로 사용됩니다.)과 플랫폼을 선택합니다. 앱을 생성하면 앱 리스트에 노출되며, 앱이름을 클릭해서 더 상세한 설정을 할 수 있습니다. 광고 단위 만들기 버튼을 통해 광고 단위를 생성합니다. 현재 배너, 전면, 리워드 이렇게 3가지 광고 타입을 제공합니다. 앱의 사용성을 선택해서 선택하면 되는데, 저는 배너를 사용했습니다. 광고 단위 이름을 입력해줍니다. 광고 단위가 생성되었습니다. 이제 AppID와 UnitID를 통해 앱에 광고를 부착할 수 있습니다.이 페이지에서 2개의 ID값을 볼 수 있는데요, 위에가 AppID, 아래가 UnitID입니다. AppID : 앱의 Identifier, AppDelegate.m 에서 설정에 필요 UnitID : 배너 광고를 띄울 뷰컨트롤러 설정에 필요 CocoaPods 설치이제 앱에 배너광고를 설치합니다.Podfile에 아래 Pod를 추가하고 Pod install을 통해 SDK를 설치합니다. 1pod &apos;Google-Mobile-Ads-SDK&apos; App Delegate 설정AppDelegate.m 파일을 열어주세요. 1#import &lt;GoogleAnalytics/GAI.h&gt; 위 헤더파일이 필요합니다. 아래 코드와 같이 didFinishLaunchingWithOptions 메소드에 애드몹을 설정하는 코드를 추가합니다. 1234567- (BOOL)application:(UIApplication *)application didFinishLaunchingWithOptions:(NSDictionary *)launchOptions &#123; // Override point for customization after application launch. [GADMobileAds configureWithApplicationID:@\"애드몹AppId\"]; return YES;&#125; Banner 영역 설정하기 스토리보드에서 Banner영역을 잡아줍니다.저는 화면 아래쪽에 배치했습니다. Banner의 Size는 320 * 50으로 지정해주셔야합니다. 그리고 그 View 의 CustomClass를 GADBannerView로 설정합니다. 이제 코드영역에서 해당 뷰에 UnitID를 지정해줘야 합니다. 이 작업은 ViewDidLoad 에서 작업합니다. 123self.bannerView.adUnitID = admobBannerUnitId;self.bannerView.rootViewController = self;[self.bannerView loadRequest:[GADRequest request]]; 여기에서 self.bannerView는 스토리보드에서 IBOutlet으로 가져온 GADBannerView 입니다.admobBannerUnitId 을 발급받은 UnitID로 변경합니다. 추가적으로, bannerView에 델리게이트를 지정하여 광고를 성공적으로 가져왔는지, 문제가 있는지 등의 결과를 받을 수 있습니다. 해당내용은 아래에 링크합니다.https://developers.google.com/admob/ios/banner Test 광고 붙여보기위 과정까지 진행하고 앱을 실행시켜보면 광고가 뜨지 않습니다. 왜냐하면 Debug 모드에서는 광고가 노출되지 않기 때문이죠. 그러면 어떻게 광고가 잘 노출되는지 확인할 수 있을까요.ADMob에서는 테스트 광고를 제공합니다. 발급받은 AppID와 UnitID중에서 UnitID를 ca-app-pub-3940256099942544/6300978111 로 변경합니다. 위 테스트 UnitID는 배너 타입의 광고에만 유효하며 그 외 타입은 다음 링크를 참고해주세요.https://developers.google.com/admob/android/test-ads 이제 앱을 다시 실행해보면 테스트 광고가 노출되는 것을 확인할 수 있습니다. 빌드 과정에서 Release config로 빌드하는 경우 실제 UnitID를 사용하고, Debug로 빌드하는 경우 테스트용 UnitID를 사용하게 설정해두면 편합니다! 더 나아가서ADMob에서는 더 다양한 기능을 제공합니다.예를들면 광고를 불러오기 전까지는 배너 영역을 갖고있지 않다가, 광고를 받아오면 해당 배너영역을 확장시켜 보여줄 수도 있습니다.","categories":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/categories/iOS/"},{"name":"Etc","slug":"iOS/Etc","permalink":"http://monibu1548.github.io/categories/iOS/Etc/"}],"tags":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/tags/iOS/"},{"name":"Admob","slug":"Admob","permalink":"http://monibu1548.github.io/tags/Admob/"},{"name":"애드몹","slug":"애드몹","permalink":"http://monibu1548.github.io/tags/애드몹/"}]},{"title":"Interface Builder IBOutlet연결에 Strong과 Weak 어떤것을 써야할까?","slug":"iboutlet-strong-weak","date":"2018-05-03T11:34:36.000Z","updated":"2018-05-05T19:08:53.563Z","comments":true,"path":"2018/05/03/iboutlet-strong-weak/","link":"","permalink":"http://monibu1548.github.io/2018/05/03/iboutlet-strong-weak/","excerpt":"IBOutlet의 Strong vs Weak Interface Builder를 사용하는 프로젝트에서 View를 코드상에서 제어하기 위해 IBOutlet으로 스토리보드 코드 를 연결하게 됩니다. Ctrl키를 누르고 View를 .m 또는 .h 파일로 가져오면 다음과 같이 IBOutlet 연결 팝업이 뜹니다. 여기에서 아마도 Property명 또는 Action명을 입력 후 Connect 버튼을 눌러 커넥션을 생성하셨을텐데요. 혹시, 아래쪽의 Storage 영역을 확인해보신적이 있으신가요? 아마도 디폴트 값은 Weak 일겁니다. 여","text":"IBOutlet의 Strong vs WeakInterface Builder를 사용하는 프로젝트에서 View를 코드상에서 제어하기 위해 IBOutlet으로 스토리보드 코드 를 연결하게 됩니다.Ctrl키를 누르고 View를 .m 또는 .h 파일로 가져오면 다음과 같이 IBOutlet 연결 팝업이 뜹니다. 여기에서 아마도 Property명 또는 Action명을 입력 후 Connect 버튼을 눌러 커넥션을 생성하셨을텐데요.혹시, 아래쪽의 Storage 영역을 확인해보신적이 있으신가요? 아마도 디폴트 값은 Weak 일겁니다. 여기에서 Strong, Weak 는 ARC(Auto Reference Count)와 관련이 깊습니다.Strong, Weak에 대한 자세한 내용은 다른 포스트에서 다루도록 하겠습니다. 간단히 소개하자면, Strong은 소유대상의 reference count를 1 증가시킴으로써 dealloc 되지 않도록 하고, Weak 는 reference count는 증가시키지 않고 소유함으로써 상호참조 발생을 막아 메모리 누수를 막기위해 사용합니다. Dafault는 Weak니까 당연히 Weak을 써야지?네, 아마 커넥션 팝업에서 디폴트로 Weak가 선택되어 있습니다. 왜 Weak가 디폴트일까요? Strong 으로 사용할 때 문제가 있는지 먼저 살펴보겠습니다.ViewController, View, Label 이 3가지 요소로 확인해보도록 하겠습니다. IBOutlet에 Strong을 사용한 경우 시나리오위 사진과 같이 Strong으로 연결을 한 경우 Reference Count를 계산해봅시다. 코드에서 ViewController가 Strong으로 aView를 소유하므로 =&gt; aView:1 Interface Builder에서 aView가 Label subView로 소유하므로 =&gt; aView:1, Label:1 코드에서 ViewController가 Strong으로 Label을 소유하므로 =&gt; aView:1, Label:2 그렇다면 여기에서 메모리 누수가 발생할 가능성이 있을까요? ViewController가 dealloc 된다고 가정해보면ViewController가 dealloc되는 시나리오로 다시 Reference Count를 계산해봅니다. ViewController가 dealloc되므로 소유하고 있던 aView의 reference count를 감소 =&gt; aView:0 (aView의 Reference Count가 0이 되어 dealloc 됩니다) Label을 소유하던 aView가 dealloc 되므로 Label의 reference Count 감소 =&gt; aView:dealloc 됨, Label:1 ViewController가 dealloc되므로 소유하고 있던 Label reference Count 감소 =&gt; aView:dealloc 됨, Label:0 Label의 Reference Count가 0이 되어 dealloc 됩니다) 모두가 깔끔하게 Dealloc 되는 해피앤딩 입니다.이렇듯 IBOutlet에 Strong 을 쓴다고 해서 잘못된 일은 아닙니다. 오히려 Strong을 써야하는 경우가 있습니다!!! IBOutlet에 Strong을 써야 하는 경우복잡한 뷰 Hierarchy를 가진 경우에는 Weak 대신 Strong을 써야만 하는 경우도 존재합니다.깊은 뷰 Hierarchy 구조에서 모든 Connection이 Weak라고 한다면 중간쯤 있는 View가 어느 이유에서인지 dealloc이 된다면? 그 하위뷰들도 함께 dealloc이 됩니다.만약 복잡한 뷰 Hierechy 구조상에서 subview의 subview를 사용해야 하는 경우. 의도치 않은 nil을 경험할 수도 있습니다. 일반적이지는 않지만 충분히 겪을 수 있습니다. 그러면 Strong이 복잡한 Hierarchy에도 문제없고, 메모리 누수도 없으니 무조건 Strong을 쓰면 되나요?아뇨 Default 값이 Weak인 이유가 또 있겠죠. 좀 더 일반적인 상황에서 Weak가 유리한 상황이 존재합니다. 바로 메모리 부족 메모리가 부족하면 ViewController의 didReceiveMemoryWarning가 호출됩니다.보통 didReceiveMemoryWarning 에서 main view를 nil 처리함으로써 main view를 포함한 subview들 까지 모두 dealloc 하여 메모리를 확보하는 동작을 구현합니다. 이 경우에 IBOutlet Strong 으로 Subview들을 갖고있다면, ViewController가 Strong으로 갖고있는 Reference Count 1 때문에 절대 최소 1 이하로 내려가질 않습니다.즉, 그 Subview의 ParentView가 nil이 되더라도 SubView는 dealloc되지 않게 됩니다. 보이지도 않는 뷰가 메모리를 차지하게 되어버리는 것이죠. 결론디폴트로 Weak을 사용하는게 좋습니다. 그 외 정말 위에서 소개한 특별한 상황 (복잡한 뷰 Hierarchy)를 이해하고 정말 필요할 때 Strong으로 사용하시면 됩니다.","categories":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/categories/iOS/"},{"name":"Etc","slug":"iOS/Etc","permalink":"http://monibu1548.github.io/categories/iOS/Etc/"}],"tags":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/tags/iOS/"},{"name":"Interface Builder","slug":"Interface-Builder","permalink":"http://monibu1548.github.io/tags/Interface-Builder/"},{"name":"Storyboard","slug":"Storyboard","permalink":"http://monibu1548.github.io/tags/Storyboard/"}]},{"title":"[Objective-C] NSXMLParser로 XML Object Mapper 구현하기 (공공데이터 Response 파싱하기)","slug":"xml-mapper","date":"2018-05-01T14:32:01.000Z","updated":"2018-05-01T15:40:56.868Z","comments":true,"path":"2018/05/01/xml-mapper/","link":"","permalink":"http://monibu1548.github.io/2018/05/01/xml-mapper/","excerpt":"공공데이터 Open API data.go.kr에서 다양한 공공데이터 정보를 얻을 수 있습니다. 단순 데이터 파일 또는 Open API형태로 제공하고 있어서 이를 이용해 다양한 서비스를 구현할 수 있습니다. 지역 미세먼지 농도, 날씨 예보, 수질 정보 등등 정말 다양한 정보를 얻을 수 있는데요, 스터디용도로 이 API 중 하나를 선택해서 앱을 구현중입니다. 지방선거 API 활용하기 가장 최신으로 등록된 API를 찾아보니 곧 6월 13일 지방선거를 앞두고 선거정보, 후보자 정보 Open API가 추가되어서 활용해보기로 했습니다. 역시","text":"공공데이터 Open APIdata.go.kr에서 다양한 공공데이터 정보를 얻을 수 있습니다. 단순 데이터 파일 또는 Open API형태로 제공하고 있어서 이를 이용해 다양한 서비스를 구현할 수 있습니다.지역 미세먼지 농도, 날씨 예보, 수질 정보 등등 정말 다양한 정보를 얻을 수 있는데요, 스터디용도로 이 API 중 하나를 선택해서 앱을 구현중입니다. 지방선거 API 활용하기가장 최신으로 등록된 API를 찾아보니 곧 6월 13일 지방선거를 앞두고 선거정보, 후보자 정보 Open API가 추가되어서 활용해보기로 했습니다.역시 공공데이터 답게 Response API는 XML을 지원합니다.. 제발 json을 사용해주세요 ㅠㅜ XML 보다 json을 선호하는 이유는 다음과 같습니다. json은 dict, list, string, number의 타입으로 구성되어 있죠. Objective-C 에서 사용하는 데이터 타입과 다르지 않아요. 그래서 json을 object로 매핑해주기 편합니다! xml은 list 타입이 없죠, 같은 depth에 동일한 태그가 여러개 구성되어 있는걸 list라고 판단해야 합니다. 우연히 해당 태그가 1개만 오면 이게 단순 key-value인지 list인지 알 방법이 없죠. XML 파싱하기Objective-C 에서는 NSXMLParser 라는 클래스를 제공하여 쉽게 XML을 파싱할 수 있도록 도와주고 있습니다.NSXMLParser로 XML을 파싱하는 순서는 다음과 같습니다. NSXMLParser에 파싱할 XML데이터 주입 parse 메소드 호출 NSXMLParser의 델리게이트 호출 (문서 시작, 태그 시작, 태그 끝, 문서 종료 등..) NSXMLParser Delegate12- (void)parserDidStartDocument:(NSXMLParser *)parser &#123;&#125; XML 문서가 시작했음을 알리는 Delegate입니다. 처음 1회만 수행합니다. 123- (void)parser:(NSXMLParser *)parser didStartElement:(NSString *)elementName namespaceURI:(NSString *)namespaceURI qualifiedName:(NSString *)qName attributes:(NSDictionary&lt;NSString *,NSString *&gt; *)attributeDict &#123;&#125; &lt;태그&gt; 를 발견했을 때 호출됩니다. elementName값으로 태그가 넘어옵니다.&lt;태그 속성=값&gt; 의 형식으로 된 XML태그의 경우 attributes dict 파라미터로 @{ @”속성”, @”값” } 이 전달됩니다. 12- (void)parser:(NSXMLParser *)parser didEndElement:(NSString *)elementName namespaceURI:(NSString *)namespaceURI qualifiedName:(NSString *)qName &#123;&#125; &lt;/태그&gt; 를 발견했을 때 호출됩니다. elementName 값으로 태그가 넘어옵니다. 12- (void)parser:(NSXMLParser *)parser foundCharacters:(NSString *)string &#123;&#125; 일반 문자열을 발견했을 때 호출됩니다.&lt;태그&gt;안녕하세요&lt;/태그&gt; 이 경우에 didStartElement 로 태그 값을 읽은 후 foundCharacters 메소드로 안, 녕, 하, 세, 요 가 한글자씩 전달됩니다. 123- (void)parserDidEndDocument:(NSXMLParser *)parser &#123;&#125;XML 문서가 끝났을 때 호출됩니다. 5개 Delegate 외에 파싱 에러 등 다른 메소드도 있지만 option으로 꼭 구현이 필요하진 않습니다 XML Parsing 코드선거 정보 API 에서 내려오는 XML 예제는 다음과 같습니다. 12345678910111213141516171819202122232425262728&lt;?xml version=\"1.0\" encoding=\"UTF-8\"?&gt;&lt;response&gt; &lt;header&gt; &lt;resultCode&gt;INFO-00&lt;/resultCode&gt; &lt;resultMsg&gt;NORMAL SERVICE&lt;/resultMsg&gt; &lt;/header&gt; &lt;body&gt; &lt;items&gt; &lt;item&gt; &lt;num&gt;1&lt;/num&gt; &lt;sgId&gt;20180613&lt;/sgId&gt; &lt;sgName&gt;제7회 전국동시지방선거&lt;/sgName&gt; &lt;sgTypecode&gt;0&lt;/sgTypecode&gt; &lt;sgVotedate&gt;20180613&lt;/sgVotedate&gt; &lt;/item&gt; &lt;item&gt; &lt;num&gt;2&lt;/num&gt; &lt;sgId&gt;220180613&lt;/sgId&gt; &lt;sgName&gt;국회의원선거&lt;/sgName&gt; &lt;sgTypecode&gt;2&lt;/sgTypecode&gt; &lt;sgVotedate&gt;20180613&lt;/sgVotedate&gt; &lt;/item&gt; &lt;/items&gt; &lt;numOfRows&gt;10&lt;/numOfRows&gt; &lt;pageNo&gt;1&lt;/pageNo&gt; &lt;totalCount&gt;10&lt;/totalCount&gt; &lt;/body&gt;&lt;/response&gt; 중간에 &lt;item&gt; 이 엄청 많이 나오는데 list를 표현하기위해 2개만 남기고 나머지는 생략처리했습니다. 위 XML에 매핑할 Object는 다음과 같이 작성했습니다. 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859//// EHElectionSchedule.h// ElectionHelper//// Created by JingyuJung on 2018. 4. 29..// Copyright © 2018년 JingyuJung. All rights reserved.//#import &lt;Foundation/Foundation.h&gt;@interface EHElectionSchedule : NSObject@property (nonatomic, strong) NSNumber *sgId;@property (nonatomic, strong) NSString *sgName;@property (nonatomic, strong) NSNumber *sgTypecode;@property (nonatomic, strong) NSString *sgVotedate;@end@interface EHElectionSchedule_XMLArray : NSMutableArray@end@interface EHElectionScheduleResponseHeader : NSObject@property (nonatomic, strong) NSString *resultCode;@end@interface EHElectionScheduleItems : NSObject@property (nonatomic, strong) EHElectionSchedule_XMLArray *item;@end@interface EHElectionScheduleResponseBody : NSObject@property (nonatomic, strong) EHElectionScheduleItems *items;@end@interface EHElectionScheduleResponse : NSObject@property (nonatomic, strong) EHElectionScheduleResponseHeader *header;@property (nonatomic, strong) EHElectionScheduleResponseBody *body;@end@interface EHElectionScheduleResponseContainer : NSObject@property (nonatomic, strong) EHElectionScheduleResponse *response;@end 클래스를 읽는 방향은 아래쪽부터 위로 읽어가면 됩니다.규칙은 다음과 같습니다. 클래스는 XML에서 1 Depth를 의미합니다. 프로퍼티명은 XML에서 tag 값과 일치해야 합니다. Array Type 을 표현할 경우 {Array에 담길 클래스}{Array타입임을 알릴 Suffix} 의 클래스를 추가적으로 선언해야 합니다. Suffix에 _XMLArray를 사용한 이유는 Parser코드에서 볼 수 있습니다. 프로퍼티의 클래스 타입은 Custom, NSString, NSNumber 입니다. (Primitive 타입 지원하지 않습니다.. 못합니다 ㅠㅜ) XML Parser우선 Full Code 입니다. 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778798081828384858687888990919293949596979899100101102103104105106107108109110111112113114115116117118119120121122123124125126127128129130131132133134135136137138139140141142143144145146147148149150151152153154155156157158159160161162163164165166167168169170171172173174175176177178179180181182183184185//// EHXMLSerializer.m// ElectionHelper//// Created by JingyuJung on 2018. 4. 29..// Copyright © 2018년 JingyuJung. All rights reserved.//#import \"EHXMLSerializer.h\"#import &lt;objc/runtime.h&gt;@interface EHXMLSerializer ()@property (nonatomic, strong) NSXMLParser *parser;@property (nonatomic, strong) NSMutableArray&lt;id&gt; *keyStack;@property (nonatomic, strong) NSMutableString *value;@property (nonatomic, strong) Class wrapperClass;@property (nonatomic, strong) id result;@endstatic NSString *const kEHXMLArraySuffix = @\"_XMLArray\";@implementation EHXMLSerializer#pragma mark - Constructor+ (instancetype)serializer &#123; static EHXMLSerializer *shared = nil; static dispatch_once_t onceToken; dispatch_once(&amp;onceToken, ^&#123; shared = [[EHXMLSerializer alloc] init]; [shared EH_initializeXMLParser]; &#125;); return shared;&#125;#pragma mark - Public- (id)modelWithXMLResponse:(NSURLResponse *)response &#123; [_parser parse]; return nil;&#125;#pragma mark - Private- (void)EH_initializeXMLParser &#123; _parser = [[NSXMLParser alloc] init]; _parser.delegate = self;&#125;- (id)responseObjectForResponse:(NSURLResponse *)response data:(NSData *)data error:(NSError *__autoreleasing _Nullable *)error &#123; NSError *anError = nil; if (![_responseClass isSubclassOfClass:NSData.class]) &#123; NSXMLParser *parser = [[NSXMLParser alloc] initWithData:data]; if (parser &amp;&amp; !anError) &#123; if (_responseClass) &#123; parser.delegate = self; [parser parse]; &#125; &#125; &#125; return _result;&#125;#pragma mark - NSXMLParserDelegate- (void)parserDidStartDocument:(NSXMLParser *)parser &#123; _result = [[_responseClass alloc] init]; _keyStack = [NSMutableArray array]; [_keyStack addObject:_result];&#125;- (void)parser:(NSXMLParser *)parser didStartElement:(NSString *)elementName namespaceURI:(NSString *)namespaceURI qualifiedName:(NSString *)qName attributes:(NSDictionary&lt;NSString *,NSString *&gt; *)attributeDict &#123; NSObject *parentObject = _keyStack.lastObject; Class propertyClass = [self EH_classWithParentObject:parentObject propertyName:elementName]; if (propertyClass) &#123; id childObject; if (propertyClass == [NSNumber class]) &#123; // NSNumber의 경우 init 제공 X =&gt; nil 방지처리 childObject = [[NSNumber alloc] initWithInt:0]; &#125; else if ([NSStringFromClass(propertyClass) hasSuffix:kEHXMLArraySuffix]) &#123; NSString *elementClassString = [NSStringFromClass(propertyClass) stringByReplacingOccurrencesOfString:kEHXMLArraySuffix withString:@\"\"]; NSMutableArray *array = [parentObject valueForKey:elementName]; if (![array isKindOfClass:[NSArray class]]) &#123; [_keyStack addObject:[NSMutableArray array]]; &#125; else &#123; [_keyStack addObject:array]; &#125; propertyClass = NSClassFromString(elementClassString); childObject = [[propertyClass alloc] init]; &#125; else &#123; childObject = [[propertyClass alloc] init]; &#125; [_keyStack addObject:childObject]; _value = [NSMutableString string]; &#125;&#125;- (void)parser:(NSXMLParser *)parser didEndElement:(NSString *)elementName namespaceURI:(NSString *)namespaceURI qualifiedName:(NSString *)qName &#123; NSObject *parentObject = [_keyStack objectAtIndex:_keyStack.count - 2]; NSMutableArray *wrapperArray; BOOL isArrayType = [parentObject isKindOfClass:[NSArray class]]; if (isArrayType) &#123; wrapperArray = (NSMutableArray *)parentObject; parentObject = [_keyStack objectAtIndex:_keyStack.count - 3]; &#125; Class propertyClass = [self EH_classWithParentObject:parentObject propertyName:elementName]; if (!propertyClass) &#123; return; &#125; id value = [_value length] ? _value : _keyStack.lastObject; if (isArrayType) &#123; [(NSMutableArray *)wrapperArray addObject:_keyStack.lastObject]; [_keyStack removeLastObject]; value = wrapperArray; &#125; [parentObject setValue:value forKey:elementName]; [_keyStack removeLastObject]; _value = nil;&#125;- (void)parser:(NSXMLParser *)parser foundCharacters:(NSString *)string &#123; [_value appendString:string];&#125;- (void)parserDidEndDocument:(NSXMLParser *)parser &#123; _result = _keyStack.firstObject;&#125;- (Class)EH_classWithParentObject:(NSObject *)object propertyName:(NSString *)propertyName &#123; Class objectClass = object.class; Class result; unsigned int propertiesCount = 0; objc_property_t *properties = class_copyPropertyList(objectClass, &amp;propertiesCount); for (int index = 0; index &lt; propertiesCount; index++) &#123; objc_property_t property = properties[index]; const char *cname = property_getName(property); NSString *name = [NSString stringWithUTF8String:cname]; if ([name isEqualToString:propertyName]) &#123; const char *type = property_getAttributes(property); NSString *typeString = [NSString stringWithUTF8String:type]; NSArray *attributes = [typeString componentsSeparatedByString:@\",\"]; NSString *typeAttribute = [attributes objectAtIndex:0]; NSString *propertyType = [typeAttribute substringFromIndex:1]; NSString *propertyClass = [self EH_removeNotNeededChar:propertyType]; result = NSClassFromString(propertyClass); &#125; &#125; free(properties); return result;&#125;- (NSString *)EH_removeNotNeededChar:(NSString *)originString &#123; if (originString.length &lt; 3) &#123; return nil; &#125; if ([[originString substringWithRange:NSMakeRange(0, 2)] isEqualToString:@\"@\\\"\"] &amp;&amp; [[originString substringWithRange:NSMakeRange(originString.length - 1, 1)] isEqualToString:@\"\\\"\"]) &#123; return [originString substringWithRange:NSMakeRange(2, originString.length - 3)]; &#125; return nil;&#125;@end 이제 구간별로 살펴보겠습니다. 라인 : 13 - 231234567891011@interface EHXMLSerializer ()@property (nonatomic, strong) NSXMLParser *parser;@property (nonatomic, strong) NSMutableArray&lt;id&gt; *keyStack;@property (nonatomic, strong) NSMutableString *value;@property (nonatomic, strong) Class wrapperClass;@property (nonatomic, strong) id result;@end parser는 파싱을 수행할 parserkeyStack은 태그를 읽어나가면서 Depth를 관리하기 위한 Stack 입니다value는 태그의 값을 관리하기 위한 MutableString 입니다wrapperClass는 array 타입으로 된 부분을 파싱하기 위한 프로퍼티입니다result는 최종 파싱 결과물이 될 프로퍼티입니다. 라인 : 17 - 42 12345678910111213141516static NSString *const kEHXMLArraySuffix = @\"_XMLArray\";@implementation EHXMLSerializer#pragma mark - Constructor+ (instancetype)serializer &#123; static EHXMLSerializer *shared = nil; static dispatch_once_t onceToken; dispatch_once(&amp;onceToken, ^&#123; shared = [[EHXMLSerializer alloc] init]; [shared EH_initializeXMLParser]; &#125;); return shared;&#125; @&quot;_XMLArray&quot; 는 해당 클래스가 XML을 파싱할 때 Array 타입으로 해야한다는 걸 알리기 위해 Model 작성할 때 명시적으로 붙였던 Suffix 입니다.serialilzer 는 GCD를 이용해 싱글톤으로 구현한 생성자입니다. 라인 : 56 - 69 1234567891011121314- (id)responseObjectForResponse:(NSURLResponse *)response data:(NSData *)data error:(NSError *__autoreleasing _Nullable *)error &#123; NSError *anError = nil; if (![_responseClass isSubclassOfClass:NSData.class]) &#123; NSXMLParser *parser = [[NSXMLParser alloc] initWithData:data]; if (parser &amp;&amp; !anError) &#123; if (_responseClass) &#123; parser.delegate = self; [parser parse]; &#125; &#125; &#125; return _result;&#125; response 로 받아온 XML Data를 이용해서 외부에서 호출하는 메소드입니다.외부에서 이 메소드를 호출하기 전에 responseClass에 이 XML에 매핑할 클래스를 set 해주는 과정이 꼬오옥 필요합니다. 12[[EHXMLSerializer serializer] setResponseClass:[EHElectionScheduleResponseContainer class]]; EHElectionScheduleResponseContainer *container = [[EHXMLSerializer serializer] responseObjectForResponse:response data:responseObject error:&amp;error]; API 호출을 완료한 후 Model에 Mapping 하기 위해 Parser호출하는 부분 [parser parse]에 의해 파싱이 시작됩니다. 라인 : 73 - 7712345- (void)parserDidStartDocument:(NSXMLParser *)parser &#123; _result = [[_responseClass alloc] init]; _keyStack = [NSMutableArray array]; [_keyStack addObject:_result];&#125; XML 문서 파싱을 시작할 때 호출됩니다. 파싱에 필요한 프로퍼티들을 초기화합니다. 가장 첫번째 Response 객체를 keyStack에 담는것으로 파싱을 시작합니다. 라인 : 79 - 1051234567891011121314151617181920212223242526- (void)parser:(NSXMLParser *)parser didStartElement:(NSString *)elementName namespaceURI:(NSString *)namespaceURI qualifiedName:(NSString *)qName attributes:(NSDictionary&lt;NSString *,NSString *&gt; *)attributeDict &#123; NSObject *parentObject = _keyStack.lastObject; Class propertyClass = [self EH_classWithParentObject:parentObject propertyName:elementName]; if (propertyClass) &#123; id childObject; if (propertyClass == [NSNumber class]) &#123; childObject = [[NSNumber alloc] initWithInt:0]; &#125; else if ([NSStringFromClass(propertyClass) hasSuffix:kEHXMLArraySuffix]) &#123; NSString *elementClassString = [NSStringFromClass(propertyClass) stringByReplacingOccurrencesOfString:kEHXMLArraySuffix withString:@\"\"]; NSMutableArray *array = [parentObject valueForKey:elementName]; if (![array isKindOfClass:[NSArray class]]) &#123; [_keyStack addObject:[NSMutableArray array]]; &#125; else &#123; [_keyStack addObject:array]; &#125; propertyClass = NSClassFromString(elementClassString); childObject = [[propertyClass alloc] init]; &#125; else &#123; childObject = [[propertyClass alloc] init]; &#125; [_keyStack addObject:childObject]; _value = [NSMutableString string]; &#125;&#125; XML 에서 태그를 발견하면 keyStack의 lastObject (1 depth 상위 클래스) 에 포함된 프로퍼티인지 확인합니다. 없다면 굳이 매핑이 필요없으므로 패스!포함되어있다면 해당 프로퍼티의 클래스를 판별하고 할당하여 keyStack에 담아둡니다. _value NSMutableString 을 할당하여 값을 읽을 준비를 합니다. 라인 : 136 - 138123- (void)parser:(NSXMLParser *)parser foundCharacters:(NSString *)string &#123; [_value appendString:string];&#125; 태그 사이의 값들을 _value 에 appending해 나가면서 값을 완성시켜 나갑니다. 라인 : 107 - 13412345678910111213141516171819202122232425262728- (void)parser:(NSXMLParser *)parser didEndElement:(NSString *)elementName namespaceURI:(NSString *)namespaceURI qualifiedName:(NSString *)qName &#123; NSObject *parentObject = [_keyStack objectAtIndex:_keyStack.count - 2]; NSMutableArray *wrapperArray; BOOL isArrayType = [parentObject isKindOfClass:[NSArray class]]; if (isArrayType) &#123; wrapperArray = (NSMutableArray *)parentObject; parentObject = [_keyStack objectAtIndex:_keyStack.count - 3]; &#125; Class propertyClass = [self EH_classWithParentObject:parentObject propertyName:elementName]; if (!propertyClass) &#123; return; &#125; id value = [_value length] ? _value : _keyStack.lastObject; if (isArrayType) &#123; [(NSMutableArray *)wrapperArray addObject:_keyStack.lastObject]; [_keyStack removeLastObject]; value = wrapperArray; &#125; [parentObject setValue:value forKey:elementName]; [_keyStack removeLastObject]; _value = nil;&#125; 태그가 끝나면 keyStack의 마지막 object에 값을 KVC로 셋하고 _keyStack에서 완성된 lastObject를 제거합니다.만약 부모클래스가 Array 타입이었다면 현재 완성된 클래스를 Array에 추가시켜줍니다. 라인 : 140 - 142123- (void)parserDidEndDocument:(NSXMLParser *)parser &#123; _result = _keyStack.firstObject;&#125; XML 문서가 끝나면 최종적으로 keyStack에는 최상위 클래스가 남게됩니다. 따라서 result에 _keyStack의 firstObject를 연결합니다. 라인 : 144 - 1721234567891011121314151617181920212223242526272829- (Class)EH_classWithParentObject:(NSObject *)object propertyName:(NSString *)propertyName &#123; Class objectClass = object.class; Class result; unsigned int propertiesCount = 0; objc_property_t *properties = class_copyPropertyList(objectClass, &amp;propertiesCount); for (int index = 0; index &lt; propertiesCount; index++) &#123; objc_property_t property = properties[index]; const char *cname = property_getName(property); NSString *name = [NSString stringWithUTF8String:cname]; if ([name isEqualToString:propertyName]) &#123; const char *type = property_getAttributes(property); NSString *typeString = [NSString stringWithUTF8String:type]; NSArray *attributes = [typeString componentsSeparatedByString:@\",\"]; NSString *typeAttribute = [attributes objectAtIndex:0]; NSString *propertyType = [typeAttribute substringFromIndex:1]; NSString *propertyClass = [self EH_removeNotNeededChar:propertyType]; result = NSClassFromString(propertyClass); &#125; &#125; free(properties); return result;&#125; 해당 obejct에 propertyName이라는 변수명을 가진 프로퍼티의 클래스를 리턴해주는 함수입니다.Objective-C의 인스트로펙션, 자바에서 리플렉션이라 불리는 기능을 이용해 구현합니다. 라인 : 174 - 18312345678910- (NSString *)EH_removeNotNeededChar:(NSString *)originString &#123; if (originString.length &lt; 3) &#123; return nil; &#125; if ([[originString substringWithRange:NSMakeRange(0, 2)] isEqualToString:@\"@\\\"\"] &amp;&amp; [[originString substringWithRange:NSMakeRange(originString.length - 1, 1)] isEqualToString:@\"\\\"\"]) &#123; return [originString substringWithRange:NSMakeRange(2, originString.length - 3)]; &#125; return nil;&#125; runtime 메소드를 이용해 property의 클래스 타입을 가져왔을 때, @\\”\\” 의 불필요한 문자열이 추가되기 때문에 제거를 위해 만든 함수입니다. 결과위에서 만든 XMl Serializer를 이용해 XML을 매핑하면 다음과 같은 결과를 얻을 수 있습니다. 더 보완이 필요한 내용 현재 최종 마지막 타입은 NSString 과 NSNumber 만 지원하고 있는데, NSDate 도 추가가 필요합니다!","categories":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/categories/iOS/"},{"name":"Objective-C","slug":"iOS/Objective-C","permalink":"http://monibu1548.github.io/categories/iOS/Objective-C/"}],"tags":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/tags/iOS/"},{"name":"Reflection","slug":"Reflection","permalink":"http://monibu1548.github.io/tags/Reflection/"},{"name":"스터디","slug":"스터디","permalink":"http://monibu1548.github.io/tags/스터디/"},{"name":"XML Parser","slug":"XML-Parser","permalink":"http://monibu1548.github.io/tags/XML-Parser/"},{"name":"NSXMLParser","slug":"NSXMLParser","permalink":"http://monibu1548.github.io/tags/NSXMLParser/"}]},{"title":"[Objective-C] reflection(리플렉션), Introspection(인트로스펙션) Runtime 메소드 사용하기","slug":"objc-runtime","date":"2018-05-01T14:18:43.000Z","updated":"2018-05-01T15:36:17.514Z","comments":true,"path":"2018/05/01/objc-runtime/","link":"","permalink":"http://monibu1548.github.io/2018/05/01/objc-runtime/","excerpt":"Reflection Objective-C에서 자바의 Reflection 에 해당하는 기능을 Introspection(인트로스펙션) 이라고 합니다. 이 기능들은 헤더 파일에 선언되어 있으며, C 함수로 작성되어 있습니다. 사용할 수 있는 메소드는 애플 개발자 센터 가이드에서 확인 가능합니다. 애플 개발자 센터 Runtime 개발 가이드 가이드 문서에서 확인할 수 있듯이 수십여 가지의 메소드로 다양한 인스트로펙션 기능을 제공하고 있습니다. Introspection을 이용해서 다양한 기능을 구현할 수 있","text":"ReflectionObjective-C에서 자바의 Reflection 에 해당하는 기능을 Introspection(인트로스펙션) 이라고 합니다.이 기능들은 &lt;objc/runtime.h&gt; 헤더 파일에 선언되어 있으며, C 함수로 작성되어 있습니다. 사용할 수 있는 메소드는 애플 개발자 센터 가이드에서 확인 가능합니다.애플 개발자 센터 Runtime 개발 가이드가이드 문서에서 확인할 수 있듯이 수십여 가지의 메소드로 다양한 인스트로펙션 기능을 제공하고 있습니다. Introspection을 이용해서 다양한 기능을 구현할 수 있습니다. 특정 객체가 특정 Protocol, Method이 있는지 조사하여 앱 크래시 방지 외부 API Response로 내려온 json, XML 등을 Object Model 에 매핑할 때 Instropection을 이용한 XMl Object Mapper 구현예제스터디용으로 공공데이터를 이용한 앱을 만드는 작업을 하고 있는데, 대부분의 Response형태가 XML로 되어 있습니다. json 이면 좋을텐데 ㅠㅜNSXMLParser로 XML Object Mapper 구현하기 (공공데이터 Response 파싱하기) 포스트 보러가기 Parser에서 사용한 Instropectionclass_copy_PropertyList(Class, int *)12int propertiesCount = 0;objc_property_t *properties = class_copyPropertyList(objectClass, &amp;propertiesCount); objectClass클래스가 가진 objc_property_t 구조체들을 array로 리턴하며 배열 갯수는 propertiesCount에 담겨집니다.이렇게 반환된 properties 변수는 나중에 반드시 free(properties) 호출되어야 합니다. property_getName(objc_property_t)12const char *cname = property_getName(property);NSString *name = [NSString stringWithUTF8String:cname]; 프로퍼티의 이름 (클래스) 이름을 const char 타입으로 리턴합니다.NSString의 stringWithUTF8String을 통해 NSString으로 wrapping 가능 합니다. … 추가 작성 예정","categories":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/categories/iOS/"},{"name":"Objective-C","slug":"iOS/Objective-C","permalink":"http://monibu1548.github.io/categories/iOS/Objective-C/"}],"tags":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/tags/iOS/"},{"name":"Runtime","slug":"Runtime","permalink":"http://monibu1548.github.io/tags/Runtime/"},{"name":"Reflection","slug":"Reflection","permalink":"http://monibu1548.github.io/tags/Reflection/"}]},{"title":"XCode Server를 이용한 CI(continuous integration)","slug":"xcode-server-intro","date":"2018-04-25T13:29:35.000Z","updated":"2018-05-05T19:10:04.291Z","comments":true,"path":"2018/04/25/xcode-server-intro/","link":"","permalink":"http://monibu1548.github.io/2018/04/25/xcode-server-intro/","excerpt":"CI 란? CI란 continuous integration의 약자로 지속적 통합을 뜻한다. 작업을 작은 단위로 쪼갠 뒤, 작은 단위로 개발, 지속적으로 통합하는 과정을 통한 개발 방법으로 코드 품질향상, 배포주기 단축을 목표로 한다. iOS에서의 CI iOS 앱은 실행파일(.ipa) 하나를 Export 하는데에 인증서, 프로비저닝 등 빌드 과정에 관여하는 변수가 많아 CI를 적용하기가 까다로운 편이다. 작년까지만 해도 Jenkins에 Xcode Plugin을 붙여 빌드를 진행하고 , 그 외 OTA를 위한 manifest, arc","text":"CI 란?CI란 continuous integration의 약자로 지속적 통합을 뜻한다. 작업을 작은 단위로 쪼갠 뒤, 작은 단위로 개발, 지속적으로 통합하는 과정을 통한 개발 방법으로 코드 품질향상, 배포주기 단축을 목표로 한다. iOS에서의 CIiOS 앱은 실행파일(.ipa) 하나를 Export 하는데에 인증서, 프로비저닝 등 빌드 과정에 관여하는 변수가 많아 CI를 적용하기가 까다로운 편이다. 작년까지만 해도 Jenkins에 Xcode Plugin을 붙여 빌드를 진행하고 , 그 외 OTA를 위한 manifest, archive, export, OTA 배포까지의 과정은 Shell Script를 이용해 수동으로 작업했다. 물론, 한번 세팅해두면 이후에는 손 볼 일이 거의 없긴하다. 그러던 어느날, 앱 인증서가 만료되어, 프로비저닝과 인증서를 교체해야 하는 일이 생겼다. Jenkins에서 인증서, 프로비저닝 갱신하기 Apple developer 사이트에서 새로운 인증서와 프로비저닝을 다운로드 받는다. jenkins credential 페이지에서 인증서와 프로비저닝을 업로드 한다. 프로젝트 Plugin 에서 새로운 인증서와, 프로비저닝을 선택해준다. ipa export 하는 과정에서 프로비저닝 이름을 수동으로 입력해준다. =&gt; 수동으로 해야할 일이 꽤 많다 사실 프로젝트 1개만 있으면 문제가 없다. 그런데 나는..? 프로젝트가 3개가 있다.. 그것도 dev와 appstore로 구분하면 x2, 총 6개. 이 작업을 하면서, 아 이건 아니다 싶었고 다른 CI툴을 찾아 나섰고. 마침 XCode9 가 등장하면서 XCode Server가 무료로 내장되어 업데이트 되어 XCode Server를 사용해보기로 했다. XCode Server 설치하기사실 설치라고 할 게 없다. XCode9 를 설치하면 XCodeServer가 내장되어 있다.그렇다면 XCode Server를 활성화 시켜보자. XCode -&gt; Preference -&gt; Server &amp; Bots off -&gt; on 으로 활성화 시키자. XCode Server의 관리자 계정을 설정하고 Next를 누르다 보면 끝 setting : 서버 계정, 빌드 타임아웃 시간 설정permission : 봇을 생성하고 볼 수 있는 권한 설정mail : 빌드 과정에서 메일 알람을 주기 위한 메일 설정 이제 서버가 할 일은 끝났다. XCodeServer에 접속하기지금까지는 XCode Server를 활성화 하는 과정이었다.이제 XCode에 XCode Server를 연동하여 사용하는 과정을 소개한다. 우선 XCode에 XCode Server를 연결한다.XCode -&gt; Preference -&gt; Accounts 우측 하단의 + 를 눌러보자. 하단의 XCode Server 를 추가할 수 있도록 되어있다. 같은 맥에 XCode Server와 XCode를 구동하기 때문에 위 사진처럼 바로 목록이 뜨지만. XCode Server가 원격지에 있다면 ip를 직접 입력해줘야 한다. 그 후 XCode Server에서 권한을 부여받은 계정을 입력해주면 끝! 대화상자 하단에 XCode Server의 스펙을 볼 수 있다. Build Bot 만들기위 과정을 통해 XCode Server를 정상적으로 추가했다면 Build Bot을 생성할 수 있다.XCode Server에서는 빌드는 모두 Bot이라는 단위로 실행되며 Bot은 프로젝트 빌드 타겟과 매칭된다고 보면 된다. 이제 Bot을 만들어보자. XCode에서 Product -&gt; Create Bot... 를 선택한다. 봇의 이름과 봇을 생성할 서버를 선택한다.봇의 이름은 한글 도 가능하다. 봇을 생성하려는 프로젝트가 git을 사용중이라면 그 내용을 자동으로 긁어온다.현재 빨간색으로 레포지토리 권한이 없습니다 라고 뜨는데 오른쪽의 Sign in 으로 레포지토리 로그인을 하면 해결된다. 로그인을 완료하면 브랜치를 선택 가능하다. CI에 사용할 브랜치를 선택한다. 프로젝트의 Scheme, Configuration 을 설정할 수 있으며 Analyze 또는 Test도 선택적으로 수행 가능하다.Archive도 제공하며 ipa 까지 추출하기 위해서는 별도의 ExportOptions.plist가 필요하다. 빌드 시간과, Clean시점을 설정할 수 있어서 주기적으로 정해진 시간에 빌드를 진행, 배포할 수 있다.선택 옵션은 Preiodically, on commit, maually 이 있어서 수동 빌드도 가능하다. 여기가 진정한 XCode Server의 꽃이다 XCode에 연결된 계정에서 사용 가능한 인증서와 프로비저닝 목록을 한번에 볼 수 있으며 빌드에 필요한 인증서와 프로비저닝을 선택하여 Add to server 만 선택하면 빌드서버에 자동으로 등록 설치된다. Jenkins에서 이 작업이 얼마나 번거로웠는지,,,,, 빌드 과정에서 사용할 환경변수를 지정할 수 있다. 마지막 관문이다.빌드를 시작할 때 Slack에 보내고 빌드가 끝나면 빌드 파일을 Slack으로 보내고! 이런 작업이 필요한데바로 여기서 설정 할 수 있다. 왼쪽 하단의 + 버튼을 누르면 다양한 스크립트를 추가할 수 있다. 빌드 시작 빌드 종료 메일 전송 등 다양한 상황이 존재하며, 해당 상황에 적절한 스크립트를 통해 여러가지 기능을 확장 할 수 있다.cocoaPod 을 사용한다면 Pre-Integration 스크립트에 Pod install 을 추가해주자. 끝 Bot을 만들었으면 사용해야지Bot을 만들었는데 어디에 있는 것일까?! 얍짠 봇의 상세화면이다. 다음의 내용을 확인 할 수 있다. 테스트 성공률 Warning 수 이전 빌드보다 추가된 커밋 수 이전 빌드 이후 제거된 warning들 코드 커버리지 archive 했다면 archive file export 했다면 ipa file 짱이다 빌드를 한번 해보자. 우측 상단의 Integrate 버튼을 눌러보자. Jenkins vs XCodeServerJenkins와 XCodeServer를 사용해보면서 느낀 특징, 장단점은 다음과 같다. Jenkins 장점 Github과 연동이 잘된다. Hook을 통해 PR, Commit 등 다양한 상황과 연동 가능하다 단점 XCode8 이후로 ipa 추출하는 과정에서 ExportOptions.plist 가 추가적으로 필요하게 되었는데 아직 이를 자동으로 해주는 플러그인이 없다. 인증서, 프로비저닝 갱신 과정이 번거롭다. XCodeServer 장점 XCode와의 연동이 최고다. 인증서, 프로비저닝 관리가 가장 깔끔하다. 빌드를 위해 별도의 웹 페이지에 접속할 필요가 없다. OTA 기능도 지원한다 (근데 사실상 사용 불가… 애플놈들…) 단점 Github과의 연동이 약하다. PR을 통한 Test를 진행하는 프로젝트에서는 바로 적용이 힘들다. 아직 안정화가 될 되었다. 작은 버그들이 우수수수…. 결론적으로, XCode Server 를 선택해서 사용중이며 만족하면서 사용하고 있습니다~! 그 외의 iOS CI 툴fastlane이라는게 있답니다..!","categories":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/categories/iOS/"},{"name":"Etc","slug":"iOS/Etc","permalink":"http://monibu1548.github.io/categories/iOS/Etc/"}],"tags":[{"name":"XCodeServer","slug":"XCodeServer","permalink":"http://monibu1548.github.io/tags/XCodeServer/"},{"name":"XCode","slug":"XCode","permalink":"http://monibu1548.github.io/tags/XCode/"},{"name":"생산성","slug":"생산성","permalink":"http://monibu1548.github.io/tags/생산성/"}]},{"title":"[Objective-C] GCD를 이용한 싱글톤 객체 생성하기","slug":"GCD-singleton","date":"2018-04-25T13:11:15.000Z","updated":"2018-04-25T13:28:44.176Z","comments":true,"path":"2018/04/25/GCD-singleton/","link":"","permalink":"http://monibu1548.github.io/2018/04/25/GCD-singleton/","excerpt":"Singleton이란? 싱글톤 패턴은 하나의 프로그램(정확히는 프로세스)에 하나의 인스턴스만을 사용하기 위해 사용한다. iOS 프로젝트에서는 주로 앱 전반적인 데이터를 저장하고 관리하는 매니저 객체로 많이 사용하게 된다. C++ 또는 Java 에서도 Singleton 패턴을 많이 사용해왔는데, 보통 Singleton을 아래와 같은 방법으로 만들었을 것이다. * 생성자를 private 로 만든다 * 내부에 private static 객체를 생성한다 * getInstance() 메소드를 만들어서 단 1개의 객체를 생성, 반환하","text":"Singleton이란?싱글톤 패턴은 하나의 프로그램(정확히는 프로세스)에 하나의 인스턴스만을 사용하기 위해 사용한다.iOS 프로젝트에서는 주로 앱 전반적인 데이터를 저장하고 관리하는 매니저 객체로 많이 사용하게 된다. C++ 또는 Java 에서도 Singleton 패턴을 많이 사용해왔는데, 보통 Singleton을 아래와 같은 방법으로 만들었을 것이다. 생성자를 private 로 만든다 내부에 private static 객체를 생성한다 getInstance() 메소드를 만들어서 단 1개의 객체를 생성, 반환하도록 한다 Objective-C 에서는 명시적인 접근지정자가 없으며, thead safe하게 만들기 위해 조금 다른 방식으로 만들게 된다. 주로 sharedInstance 라는 클래스 메소드를 생성하며 GCD를 이용해 thread safe하게 만든다. 123456789101112131415161718192021@interface YNCSRManager : NSObject+ (instancetype)sharedInstance;@end@implementation YNCSRManager+ (instancetype)sharedInstance &#123; static YNCSRManager *shared = nil; static dispatch_once_t onceToken; dispatch_once(&amp;onceToken, ^&#123; shared = [[YNCSRManager alloc] init]; &#125;); return shared;&#125;@end 위 코드는 너의 이름은. 프로젝트에서 사용한 STT(Speech-To-Text) 역할을 해주는 객체로 Singleton으로 구현했다. dispatch_once 는 단 1회만 실행한다는 것을 보장하며 완벽히 synchronous 하게 동작한다. 따라서 Thead-Safe 함을 보장받을 수 있다. sharedInstance 가 처음 호출되면 shared 변수에 YNCSRManager가 할당되고, 두번째 호출부터는 첫번째 호출에서 생성된 shared 변수를 그대로 return 하여 어디서든 동일한 YNCSRManager를 활용한 코딩을 할 수 있다.","categories":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/categories/iOS/"},{"name":"Objective-C","slug":"iOS/Objective-C","permalink":"http://monibu1548.github.io/categories/iOS/Objective-C/"}],"tags":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/tags/iOS/"},{"name":"GCD","slug":"GCD","permalink":"http://monibu1548.github.io/tags/GCD/"}]},{"title":"[Swift] 열거형 Enum 사용하기","slug":"swift-enum","date":"2018-04-18T13:23:58.000Z","updated":"2018-04-25T13:27:45.679Z","comments":true,"path":"2018/04/18/swift-enum/","link":"","permalink":"http://monibu1548.github.io/2018/04/18/swift-enum/","excerpt":"스위프트의 Enum 기본 enum의 선언은 enum 키워드로 합니다. 1 2 3 4 enum Languaegs : String { case Korean = \"KR\" case Japanese = \"JP\" } 위 예시 하나로도 Obj-C의 Enum과의 많은 차이점을 느낄 수 있습니다. Enum에 String을 넣을 수 있다니!! Obj-C 에서 Enum을 NSString에 매핑하기 위해 얼마나 많은 노오오력이 필요했던가! 사용 예시 1) 서버에서 String으로 내려준 “KR”를 num에 매핑하기 1 le","text":"스위프트의 Enum 기본enum의 선언은 enum 키워드로 합니다. 1234enum Languaegs : String &#123; case Korean = \"KR\" case Japanese = \"JP\"&#125; 위 예시 하나로도 Obj-C의 Enum과의 많은 차이점을 느낄 수 있습니다. Enum에 String을 넣을 수 있다니!!Obj-C 에서 Enum을 NSString에 매핑하기 위해 얼마나 많은 노오오력이 필요했던가! 사용 예시 1) 서버에서 String으로 내려준 “KR”를 num에 매핑하기1let language = Languages.init(rawValue: \"KR\") 끝. 참 쉽죠? 사용 예시 )Swift enum을 서버에 전달하기 위해 Serialize를 하기12let language = Languages.Koreanlanguage.rawValue // \"KR\" Switch 에서의 Enum12345678let language = Languages.Koreanswitch language &#123;case .Korean: print(\"안녕하세요\")case .Japanese: print (\"こんにちは。\")&#125; 결과는 안녕하세요 Switch 또는 if 문에서 enum을 사용할 때 .Korean 처럼 enum 타입명을 앞에 붙이지 않아도 됩니다. 열거형의 이름은 스위프트의 타입 검사기가 자동으로 알아낼 수 있기 때문에 생략할 수 있습니다. 타입 이름이 긴 enum 의 경우에 유용합니다. nested enumenum 의 값으로 enum도 사용 가능합니다.12345678910111213enum Computer &#123; enum OS &#123; case Windows case Linux &#125; enum MadeBy &#123; case Apple case Samsung case LG &#125; case PowerButton case Monitor&#125; Computer.OS.WindowsComputer.MakeBy.LGComputer.PowerButton 위와 같은 예시로 사용 가능합니다. enum의 메소드기타 다른 언어와 마찬가지로 Swift 에서도 enum 에 개별 메소드 구현이 가능합니다. 123456789101112enum Languaegs : String &#123; case Korean = \"KR\" case Japanese = \"JP\" func hello() -&gt; String &#123; switch self: case .Korean return \"안녕하세요\" case .Japanese return \"こんにちは。\" &#125;&#125;let language.Korean.hello() languages.Korean.hello() 의 결과는 “안녕하세요” 입니다.메소드 내부에서는 switch 문에서 self 를 통해 적절한 분기처리를 해야합니다. 정적 메소드enum 의 인스턴스 메소드 외에도 정적 메소드 구현이 가능합니다.123456789101112131415161718enum Languages : String &#123; case Korean = \"KR\" case Japanese = \"JP\" func hello() -&gt; String &#123; switch self: case .Korean return \"안녕하세요\" case .Japanese return \"こんにちは。\" &#125; static func fromType(type : String) -&gt; Languages? &#123; if type == \"KR\" &#123; return .Korean &#125; return .Japanese &#125;&#125;Languages.fromType(\"KR\") 처럼 사용 가능하며 주로 enum을 생성할 때 rawValue로 정의되지 않은 값이 들어왔을 때 예외 처리를 위해 사용한다.","categories":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/categories/iOS/"},{"name":"Swift","slug":"iOS/Swift","permalink":"http://monibu1548.github.io/categories/iOS/Swift/"}],"tags":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/tags/iOS/"},{"name":"Swift","slug":"Swift","permalink":"http://monibu1548.github.io/tags/Swift/"},{"name":"스위프트","slug":"스위프트","permalink":"http://monibu1548.github.io/tags/스위프트/"}]},{"title":"CocoaPods 똑똑하게 사용하기 (명령어, 사용 예시 소개)","slug":"cocoapods-prompt","date":"2018-04-16T14:57:44.000Z","updated":"2018-05-05T19:09:28.705Z","comments":true,"path":"2018/04/16/cocoapods-prompt/","link":"","permalink":"http://monibu1548.github.io/2018/04/16/cocoapods-prompt/","excerpt":"Pod install iOS 프로젝트에서 CocoaPods을 사용하지 않은 프로젝트를 보기 힘들정도로 대부분의 iOS 프로젝트가 CocoaPods를 사용한다. 1 프로젝트 다운받고 -> `Pod install` -> 앱 실행 너무나도 익숙한 Flow지만 막상 다른 명령어는 뭐가 있는지, Pod install과 Pod update의 차이를 정확하게 이해하고 사용하고 있지 않다. 이번 기회에 CocoaPods 을 정확히 이해하고 사용해보자. CocoaPods 명령어 Pod install 1 pod install 가장","text":"Pod installiOS 프로젝트에서 CocoaPods을 사용하지 않은 프로젝트를 보기 힘들정도로 대부분의 iOS 프로젝트가 CocoaPods를 사용한다. 1프로젝트 다운받고 -&gt; `Pod install` -&gt; 앱 실행 너무나도 익숙한 Flow지만 막상 다른 명령어는 뭐가 있는지, Pod install과 Pod update의 차이를 정확하게 이해하고 사용하고 있지 않다. 이번 기회에 CocoaPods 을 정확히 이해하고 사용해보자. CocoaPods 명령어Pod install1pod install 가장 많이 사용하는 명령어.새로운 pod 을 다운로드, 설치하기 위해 사용한다. 다운로드 받을 pod을 결정하는 것은 Podfile.lock 또는 Podfile 이다. Podfile.lock 파일이 있다면, .lock 파일 내에 명시된 pod과 그 버전을 다운받는다. Podfile.lock 파일이 없다면, Podfile 에서 pod과 ~&gt; 으로 명시된 버전을 다운받고 Podfile.lock에 버전을 명시한다 Podfile 에서 ~&gt; 는 무엇을 의미할까?~&gt; 기호는 버전의 상한선(이보다 높을 수 없음) 을 의미한다. 버전은 메이저.마이너.패치로 구분한다. ~&gt; 0.1.2 버전 0.1.2 ~ 0.2 (0.2 이상 포함되지 않음) ~&gt; 0.1&#39; 버전 0.1 (1.0 이상 포함하지 않음) -&gt; 말고도 다른 연산자도 있다 &gt; 0.1 0.1보다 큰 모든 버전 &gt;= 0.1 버전 0.1 이상 &lt; 0.1 0.1보다 낮은 모든 버전 &lt;= 0.1 버전 0.1 및 그 이하 버전 Podfile 에 명시된 pod를 다운받고 Podfile.lock 에 다운받은 버전을 명시한다. Podfile.lock 은 왜 필요할까?Podfile.lock에 설치된 pod의 버전을 명시함으로써, pod이 업데이트 되면서 기존 앱이 동작되지 않는 문제를 해결하기 위해 Podfile.lock 에 기존 pod의 버전을 lock함으로써, 다른사람이 프로젝트를 clone 받아 pod install 했을때 유효한 pod 버전을 다운받기 위함이다! 버전픽스! Pod UpdatePodfile.lock 파일이 있는 한, Pod install 명령어를 사용하면 .lock 파일에 명시된 pod 버전에서 벗어날 수 없다. 시간이 흘러 pod 이 업데이트 되고, 업데이트 된 기능을 내 프로젝트에 적용해야 할 때, 내 프로젝트가 갖고있는 pod 을 업데이트 할 때 Pod update 를 사용한다. Pod update {팟 이름} 을 실행하면 Podfile.lock에 있는 버전은 무시하고 CocoaPods 원격 레포지토리에 있는 Pod 의 최신 버전을 다운받는다. 단! Podfile 에서 ~&gt;, &gt;= 등으로 제한을 걸어두었다면, 이 버전 제한 내의 최신버전이 적용될 것이다 Podfile.lock에 새로운 pod 버전을 명시한다 Pod update을 실행하면Podfile 에 있는 모든 Pod들을 대상으로 update 과정을 거친다 Podfile.lock 의 버전관리 (git commit에 포함해야 하나?)해야한다 뭔가 확장자가 .gitignore에 포함되어야 할 느낌이지만! Podfile.lock은 Pod 파일들의 버전을 픽스시켜주는 역할을 한다.다른사람에게 프로젝트를 공유할 때, 동일한 라이브러리 환경을 제공하기 위해 필수로 필요하며, 따라서 Git 으로 함께 버전관리를 해야한다.","categories":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/categories/iOS/"},{"name":"Etc","slug":"iOS/Etc","permalink":"http://monibu1548.github.io/categories/iOS/Etc/"}],"tags":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/tags/iOS/"},{"name":"CocoaPods","slug":"CocoaPods","permalink":"http://monibu1548.github.io/tags/CocoaPods/"}]},{"title":"iOS 프로젝트에 cocoapods 적용하기","slug":"cocoapods","date":"2018-04-16T13:46:03.000Z","updated":"2018-05-05T19:08:54.947Z","comments":true,"path":"2018/04/16/cocoapods/","link":"","permalink":"http://monibu1548.github.io/2018/04/16/cocoapods/","excerpt":"Cocoapods? iOS 앱을 개발하면서 외부 라이브러리의 필요성을 느끼게 되고, 여러 라이브러리를 사용하다보면 서로 의존성이 꼬이는 문제가 발생할 수 있다.이런 문제를 해결하기 위해 자바에서는 Maven이나 Gradle등의 의존성 관리 툴을 사용한다. iOS 생태계에도 감사하게 CocoaPods이라는 의존성 관리 툴이 있다. CocoaPods 외에도 Carthage 라는 툴이 있지만, 사용해본 적 없고 사용중인 프로젝트를 본적이 아직 없다. Cocoapods 설치 맥 사용자라면 일단 HomeBrew는 설치되어 있겠지! 아직","text":"Cocoapods?iOS 앱을 개발하면서 외부 라이브러리의 필요성을 느끼게 되고, 여러 라이브러리를 사용하다보면 서로 의존성이 꼬이는 문제가 발생할 수 있다.이런 문제를 해결하기 위해 자바에서는 Maven이나 Gradle등의 의존성 관리 툴을 사용한다.iOS 생태계에도 감사하게 CocoaPods이라는 의존성 관리 툴이 있다. CocoaPods 외에도 Carthage 라는 툴이 있지만, 사용해본 적 없고 사용중인 프로젝트를 본적이 아직 없다. Cocoapods 설치맥 사용자라면 일단 HomeBrew는 설치되어 있겠지!아직 HomeBrew를 설치하지 않았다면? 12sudo gem install cocoapodspod setup 터미널에 위 명령어를 입력하면 끝! XCode 프로젝트에 적용하기XCode 프로젝트 위치로 이동터미널에서 XCode 프로젝트 위치로 이동한다 Podfile 생성1pod init pod init 명령어를 통해 Podfile 을 생성한다. 이 Podfile은 이렇게 생겼다. 이제 사용할 pods 들을 넣는다. 네트워크를 위한 AFNetworking은 거의 필수고,이번 프로젝트에는 RXSwift를 공부 해보고 싶어서 Podsfile 에 RXSwift를 넣었다. 이렇게 만들고 저장!! Pods 설치Podfile이 완성되었으면 아래 명령어로 Pods 들을 설치한다. 1pod install Pods 가 설치된다. Pods가 모두 설치되고 나면 Podfile.lock, Pods, {프로젝트명}.xcworkspace 3개의 파일 또는 디렉토리가 생성된다. Podfile.lock : Pods 의 버전픽스를 위한 파일 Pods : 라이브러리들이 다운로드 되는 디렉토리 {프로젝트명}.xcworkspace : Pods를 사용할 수 있도록 포함된 워크스페이스 =&gt; 앞으로 이걸로 프로젝트를 열어야 한다 {프로젝트명}.xcworkspace 실행 Pod install 을 통해 생성된 워크스페이스를 실행한다.왼쪽의 메뉴바를 보면 Pods 프로젝트와, 그 내부에 Pod 들이 설치된 것을 볼 수 있다.","categories":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/categories/iOS/"},{"name":"Etc","slug":"iOS/Etc","permalink":"http://monibu1548.github.io/categories/iOS/Etc/"}],"tags":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/tags/iOS/"},{"name":"CocoaPods","slug":"CocoaPods","permalink":"http://monibu1548.github.io/tags/CocoaPods/"}]},{"title":"iOS Application 개발 시작하기 - 2 (프로비저닝 생성, XCode 프로젝트 설정)","slug":"apple-development-2","date":"2018-04-15T13:50:59.000Z","updated":"2018-05-05T19:09:27.385Z","comments":true,"path":"2018/04/15/apple-development-2/","link":"","permalink":"http://monibu1548.github.io/2018/04/15/apple-development-2/","excerpt":"지난 포스팅 iOS Application 개발 시작하기 - 1 (개발자 등록, 인증서 등록) 에서는 애플 개발자 계정을 만들고 인증서를 등록했다. 이제 앱을 디바이스에서 실행시키기 위해 Provisioning Profile 을 생성하고, Xcode 프로젝트를 생성하는 과정을 다룬다. App ID 등록 앱을 생성하기 위해서 먼저 Apple Developer에서 어떤 앱을 만들건지 App ID를 생성해야 한다. * App Name : 앱 이름 ex) YourName * Bundle Id : 앱의 번들 아이디 ex) io.gi","text":"지난 포스팅 iOS Application 개발 시작하기 - 1 (개발자 등록, 인증서 등록) 에서는 애플 개발자 계정을 만들고 인증서를 등록했다. 이제 앱을 디바이스에서 실행시키기 위해 Provisioning Profile 을 생성하고, Xcode 프로젝트를 생성하는 과정을 다룬다. App ID 등록앱을 생성하기 위해서 먼저 Apple Developer에서 어떤 앱을 만들건지 App ID를 생성해야 한다. App Name : 앱 이름 ex) YourName Bundle Id : 앱의 번들 아이디 ex) io.github.monibu1548.YourName 아래 체크박스는 어떤 추가 기능이 필요한지 선택할 수 있다. 일단 패스하고 필요한 기능이 있다면 나중에 추가가 가능하다. Provisioning Profile 생성Provisioning Profile 이란, 앱이 디바이스에서 실행 될 수 있는지 정보를 갖고 있는 파일이며 .mobileprovision 확장자를 갖는다. Provisiong Profile은 다음과 같은 정보를 갖고 있다. (Development) app bundle ID device UUID 정보 certificate 정보 참고. 앱이 디바이스에 정상적으로 설치되기 위해 거치는 검증 과정 Provisioning Profile에서 인증서 정보를 추출, 앱을 실행하려는 디바이스에서 인증서가 유효한지 확인 Provisioning Profile에서 device UUID 정보를 추출, 앱을 실행하려는 디바이스의 UUID와 일치한지 확인 CodeResources 디렉토리에서각 파일의 해시값을 실제의 파일들과 확인하여 빌드 후 수정이 되지 않았음을 확인 Provisioning Profile은 인증서와 마찬가지로 애플 개발자센터에서 생성한다. Certificates, Identifiers &amp; Profiles 메뉴에서 아래 버튼 클릭한다. 인증서 생성때와 마찬가지로 Development와 Production으로 구분되며 같은 구분의 인증서와 연결된다. 다음페이지에서는 App ID 에서 생성한 ID를 선택한다. 전 포스트에서 만들었던 인증서를 선택한다. 앱을 테스트 할 디바이스를 선택한다. 디바이스 등록은 개발자 센터 좌측 Devices 에서 어렵지 않게 가능하다! 짜잔. Provisioning Profile이 생성되었다. 다운로드 받고, 더블클릭해서 실행하자. 그러면 XCode디렉토리에 자동 등록된다. XCode 프로젝트 생성XCode 실행 -&gt; 메뉴 File -&gt; New -&gt; ProjectSingle View App 선택 App ID를 만들때 입력했던 Bundle ID 입력, App Name 입력해서 프로젝트 생성 후프로젝트 파일을 열어보면 다음과 같다. 이제 Signing 영역에서 Debug(Development), Release(AppStore) 프로비저닝을 선택하여 마무리한다. 이제부터 코딩 시작!","categories":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/categories/iOS/"},{"name":"Etc","slug":"iOS/Etc","permalink":"http://monibu1548.github.io/categories/iOS/Etc/"}],"tags":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/tags/iOS/"},{"name":"Apple","slug":"Apple","permalink":"http://monibu1548.github.io/tags/Apple/"},{"name":"Xcode","slug":"Xcode","permalink":"http://monibu1548.github.io/tags/Xcode/"}]},{"title":"iOS Application 개발 시작하기 - 1 (개발자 등록, 인증서 등록)","slug":"apple-development","date":"2018-04-15T10:59:43.000Z","updated":"2018-05-05T19:09:34.924Z","comments":true,"path":"2018/04/15/apple-development/","link":"","permalink":"http://monibu1548.github.io/2018/04/15/apple-development/","excerpt":"Apple 개발자 계정 iOS앱을 개발하고 AppStore에 등록, 판매하기 위해서 Apple에 개발자 계정을 등록해야 한다. 애플 개발자 계정은 1년에 약 한화로 10만원 정도 된다. Google에 비하면 정말 비싼가격이지만…! iOS 개발자가 개발자 계정 없이 먹고 살 수 없으니 등록하자! 준비물은 약 10만원 정도가 든 카드와, Apple 계정이다 애플 개발자 사이트 접속 https://developer.apple.com/kr/support/development/ 우측 상단의 Account 메뉴를 통해 로그인을 하면 개발","text":"Apple 개발자 계정iOS앱을 개발하고 AppStore에 등록, 판매하기 위해서 Apple에 개발자 계정을 등록해야 한다. 애플 개발자 계정은 1년에 약 한화로 10만원 정도 된다. Google에 비하면 정말 비싼가격이지만…! iOS 개발자가 개발자 계정 없이 먹고 살 수 없으니 등록하자! 준비물은 약 10만원 정도가 든 카드와, Apple 계정이다 애플 개발자 사이트 접속https://developer.apple.com/kr/support/development/ 우측 상단의 Account 메뉴를 통해 로그인을 하면 개발자 콘솔로 진입한다. 3년전 다른 프로젝트에서 iOS 개발자 등록을 하면서 renew로 뜨는 상태 새로 등록, 또는 재등록. 결국은 결제2015년 첫 등록시에도 129,000 원이었나요.. 역시 개발자 계정 등록은 회사돈으로 ㅠㅜ 결제를 마치면 감사합니다! 문구와 함께 등록이 끝나고 iOS개발을 위한 첫번째 과정이 끝난다 개발자 인증서 등록이제 개인 인증서를 앱에 서명을 하기위해 Apple에 등록을 해야한다. https://developer.apple.com/ 왼쪽 메뉴 Certificates 에서 등록 가능 합니다. 직접 인증서를 수동으로 등록하지 않아도, XCode에서 Auto Managing 옵션을 사용할 경우 자동으로 Certificate와 Provisioning profile이 생성되어 등록됩니다. 개인 혼자 앱을 개발하는 경우 AutoManaging을 사용해도 문제가 없으나, 하나의 인증서로 여러명이 개발하는 경우 Auto managing을 사용시 타인이 Revoke 시킬 수 있는 등, AutoManaging보다는 명시적으로 직접 등록하여 사용하는 것이 좋습니다. Mac 에서 인증서 생성키체인 접근 프로그램을 실행한다.메뉴 키체인 접근 -&gt; 인증서 지원 -&gt; 인증 기관에서 인증서 요청...에 진입하여 내용을 작성한다. 요청항목에서는 디스크에 저장됨을 선택해주세요디스크에 CertificateSigningRequest.certSigningRequest 파일을 저장해둡니다! 잘 보관해주세요 Apple Developer에 인증서 등록 애플 개발자 페이지에서 + 버튼을 통해 위 과정에서 만든 인증서를 등록한다https://developer.apple.com/account/ios/certificate/create 여러가지 옵션을 볼 수 있는데, iOS App Development : 개발용 인증서 Apple Push Notification service SSL : 개발용 푸시 테스트 인증서 App Store and Ad Hoc : 앱스토어 or 인하우스 배포용 인증서 Apple Push Notification service SSL : 앱스토어 or 인하우스 배포용 인증서 크게 Development와 Production 으로 구분된다. iOS를 개발하기 위해 Development 인증서를 사용하고 개발이 완료되고 AppStore에 등록하기 위해 App Store 인증서를 사용한다고 보면 된다. 지금은 개발을 위한 인증서가 먼저 필요하므로 iOS App Development를 선택한다. 그 다음. Continue, Continue 를 눌러 다음단계로 진행한다. Choose File.. 을 눌러 위 과정에서 만든 CertificateSigningRequest.certSigningRequest을 선택한다. 그러면 다음페이지에서 cer 파일을 되돌려 받게 된다. 이걸 다운로드 받아서 실행! 키체인에 등록한다. 여기까지가 iOS 앱 개발 시작을 위한 사전 준비과정이 끝났다! 디바이스에서 앱 실행을 위한 프로비저닝 생성은 다음시간에 포스팅!","categories":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/categories/iOS/"},{"name":"Etc","slug":"iOS/Etc","permalink":"http://monibu1548.github.io/categories/iOS/Etc/"}],"tags":[{"name":"iOS","slug":"iOS","permalink":"http://monibu1548.github.io/tags/iOS/"},{"name":"Apple","slug":"Apple","permalink":"http://monibu1548.github.io/tags/Apple/"},{"name":"Xcode","slug":"Xcode","permalink":"http://monibu1548.github.io/tags/Xcode/"}]},{"title":"NHNent가 만든 협업 서비스 Dooray","slug":"dooray","date":"2018-03-29T06:12:58.000Z","updated":"2018-04-15T06:14:17.407Z","comments":true,"path":"2018/03/29/dooray/","link":"","permalink":"http://monibu1548.github.io/2018/03/29/dooray/","excerpt":"JIRA vs Line Works vs Dooray 직접 사용해본 후기 JIRA : 강력한 스프린트 관리 기능! But, 위키가 쌓이면 쌓일수록 최신화 안되는 문서들이 가득, 문서찾기도 힘듦ㅠㅜ Line Works : 네이버 메일, 드라이브, 캘린더를 그대로 가져와서 익숙하다! Dooray : 처음에 배우기 어렵다…. 하지만 익숙해지면 이만한게 없다!! 빠른 문서찾기, 태그! 메신저, 메일, 프로젝트, 드라이브 안되는게 없다! Dooray의 강력한 기능들! HOOK을 통해서 자동으로 업무 등록, 댓글등록이 가능해요 * 빌드를","text":"JIRA vs Line Works vs Dooray 직접 사용해본 후기JIRA : 강력한 스프린트 관리 기능! But, 위키가 쌓이면 쌓일수록 최신화 안되는 문서들이 가득, 문서찾기도 힘듦ㅠㅜ Line Works : 네이버 메일, 드라이브, 캘린더를 그대로 가져와서 익숙하다! Dooray : 처음에 배우기 어렵다…. 하지만 익숙해지면 이만한게 없다!! 빠른 문서찾기, 태그! 메신저, 메일, 프로젝트, 드라이브 안되는게 없다! Dooray의 강력한 기능들!HOOK을 통해서 자동으로 업무 등록, 댓글등록이 가능해요 빌드를 하거나 이슈가 발생했을때 바로바로 업무등록 및 수정 알림! 우선순위, 태그, 완료일, 마일스톤 지정까지 상세하게! 업무의 우선순위 확인이나 나중에 검색할 때 엄청 편해요 메신저도 엄청나다 현재 자리에 있는지, 자리비움인지 한눈에 볼 수 있어요 업무에 최적인 메일 자동 분류 기능으로 쉽게 분류하고 찾아볼 수 있어요 그 외…말로 표현할 수 없는 정말 유용하고 다양한 기능들 마크다운으로 글을 이쁘게 쓰면 PPT 발표모드로도 사용할 수 있어요 UML도 그릴 수 있죠 다른 업무 자체를 태그할 수도 있어요 담당자에게 일을 빨리 빨리 넘길 수 있죠 NHN entertainment의 Dooray! 많이 사용해주세요 :)","categories":[{"name":"NHN ent.","slug":"NHN-ent","permalink":"http://monibu1548.github.io/categories/NHN-ent/"}],"tags":[{"name":"Dooray","slug":"Dooray","permalink":"http://monibu1548.github.io/tags/Dooray/"},{"name":"NHN","slug":"NHN","permalink":"http://monibu1548.github.io/tags/NHN/"}]},{"title":"웹 js, css 정적 파일 버전관리 방법","slug":"web-optimize-3","date":"2017-03-10T05:57:20.000Z","updated":"2018-04-15T06:00:07.019Z","comments":true,"path":"2017/03/10/web-optimize-3/","link":"","permalink":"http://monibu1548.github.io/2017/03/10/web-optimize-3/","excerpt":"js, css 정적 파일 버전 관리 WAS가 1개일때는 문제가 없지만 2개, 3개 … N개가 되면 새로운 문제가 발생한다. 크게 2가지 문제로 구분할 수 있다. 1. 최신 Back-End와 구 Front-End 의 만남 2. 브라우저 캐싱","text":"js, css 정적 파일 버전 관리WAS가 1개일때는 문제가 없지만 2개, 3개 … N개가 되면 새로운 문제가 발생한다. 크게 2가지 문제로 구분할 수 있다. 최신 Back-End와 구 Front-End 의 만남 브라우저 캐싱 &lt;- 사실 WAS가 1개일때도 문제 두가지 문제점은 어떤 이슈를 발생시키나??깨진다. 웹페이지가 깨진다. 바스락. 와장창. js 또는 css를 제대로 가져오지 못하기 때문. 원인은?L4로 묶여있는 웹 서버 집단에서 의도적으로 점진적 배포 혹은 일반 배포 단계에서 각 서버의 버전이 불일치 하는 현상이 생긴다. 이 시점에서 HTML과 js, css 요청 서버가 달라지면 서로 호환되지 않아 깨짐현상이 발생한다. 해결방법은?최신 Back-End와 구 Front-End 의 만남 =&gt; 정적 파일 버전 관리정적 파일 선배포 및 버전관리 후 Back-End 배포하여 배포 당시 시점의 css, js를 정확히 호출하게 한다. Spring에서의 설정Spring 프로젝트에 현재 정적파일의 버전 정보가 추가되어야 한다. version.properties에서 관리하기로 한다. version.number로 정적 파일의 빌드 버전을 관리한다. 밑의 version.date는 아래의 브라우저 캐싱에서 소개한다. 이제 jsp에서 정적파일 버전을 결정할 수 있도록 path에 추가한다. 이제 js, css를 수정했을 경우 version.properties에서 version.number 값을 증가시켜서 배포하면 된다 배포 서버에서의 설정버전관리를 위해 Spring에서 Resource 경로를 /{버전번호}/resources 를 참조하도록 변경했다.그러려면 서버에서는 수동으로 version number 디렉토리 만들고 정적파일들 cp로 옮기고 권한 부여하고 뭐하고 뭐하고 뭐하고….. ===&gt;&gt; 자동화하자 정적 파일이 존재하는 디렉토리를 다음과 같이 구성한다 BIULD_NUMBER는 현재 사용하고 있는 정적파일의 버전을 갖고 있는다 그러면 이제 스크립트를 통해 한방에 빠르게!! 정적파일만 선배포 할 준비가 끝났다 12345678910111213cd ~/web-resourcebn=$(&lt;BUILD_NUMBER)bn=$((bn+1))echo $bn&gt;BUILD_NUMBERmkdir $bnmkdir tempunzip -d temp asog_recent.zipmv temp/asog-1.0.0-BUILD-SNAPSHOT/resources $bn/chmod -R 0755 $bnrm -rf temprm -rf asog_recent.zip BUILD_NUMBER 에서 현재 빌드 번호를 가져오고 + 1 해서 새로운 버전의 디렉토리를 만든다. 이렇게 되면 배포시점에 HTML과 js,css 등 정적파일 매칭이 이루어지기 때문에 구서버, 신서버가 L4아래 함께있어도 호환 가능하다. 이거로 문제가 다 해결되나?그렇지 않다. 서버에서 버전에 맞는 css, js파일을 골라서 전해준다고 해도 클라이언트에서 요청하지 않으면 줄리가 없지. 브라우저에는 캐싱기능이 있다. 브라우저는 http://서비스주소/파일명.js 이렇게 다운받고 보관하고있다가 같은 URL 요청시 새로 요청을 하지 않는다. 그 기간과 상세부분은 브라우저마다 다를 수 있다. 서버가 새로운 버전으로 업데이트 되었지만 파일명이 그대로라면?js, css의 URL이 그대로다. 브라우저는 새로 바뀐걸 모른다. 안받는다 =&gt; 와장창 서버는 이 파일이 업데이트 되었는지 어떻게 클라이언트에게 알려줘야할까?브라우저는 URL을 기준으로 갖는다. 즉 URL이 다르면 새로 받는다. 그렇다면 서버를 업데이트 할 때마다 정적 파일들을 새로운 버전의 디렉토리에 넣어야하나? 변수명을 바꾸고 공백을 지우고 정말 사소한건데도 리소스가 증가해야만하나!? 편한 방법으로 클라이언트가 새로운 파일을 요청하도록 하게 하려면 어떻게 해야할까 쿼리스트링을 통해 배포 이후 웹 서비스 접근시 css, js를 새로 내려받도록 한다.기존의 URL이 http://서비스주소/파일명.js 이렇게 생겼다고 할 때 기존 URL 대신 http://서비스주소/파일명.js?param=JingyuJung 이렇게 요청을 보내면 어떻게 될까? 파일명.js 라는 같은 파일을 요청하지만 뒤에 파라미터로 URL이 추가되었다. =&gt; 파일이 수정되었을 때 param={값} 이부분을 수정하면 파일명의 변경 없이도 클라이언트가 파일을 새로 받게 할 수 있지 않을까? 무슨 값을 넣어야 할까?HTML과 js, css가 매칭되는 시점은 maven 빌드타이밍이 적절하다고 생각한다. 그렇다면 파라미터에 maven 빌드타임을 넣으면 좋을 것 같다. 메이븐 빌드타임 정보를 가져오기 위해 pom.xml에 다음의 플러그인과 설정을 추가한다. 12345678910111213&lt;plugin&gt; &lt;groupId&gt;com.keyboardsamurais.maven&lt;/groupId&gt; &lt;artifactId&gt;maven-timestamp-plugin&lt;/artifactId&gt; &lt;version&gt;1.0&lt;/version&gt; &lt;executions&gt; &lt;execution&gt; &lt;phase&gt;package&lt;/phase&gt; &lt;goals&gt; &lt;goal&gt;create&lt;/goal&gt; &lt;/goals&gt; &lt;/execution&gt; &lt;/executions&gt;&lt;/plugin&gt; 1234&lt;properties&gt; &lt;querystring&gt;$&#123;maven.build.timestamp&#125;&lt;/querystring&gt; &lt;maven.build.timestamp.format&gt;yyyyMMdd&lt;/maven.build.timestamp.format&gt;&lt;/properties&gt; 이렇게 하면 은 이제 아래의 format에 맞는 timestamp값을 갖는다. 이제 version.properties에 다음의 정보를 추가할 수 있다. ${quertstring} 은 mvn package 타임에 yyyMMdd 형태의 날짜 데이터로 변환된다. 그러면 이제 spring context 타이밍에 쿼리스트링을 붙을 차례다 정적 파일뒤에 spring tag를 이용해 쿼리스트링을 추가해준다. 참고!! : spring 태그를 사용하기 위해서는 다음과 같은 라인을 jsp에 추가해야 한다 두가지 방법이 차이가 뭔지 모르겠고 하나만 써도 되는거 아닌가?둘 다 써야 한다. 두 가지의 차이점을 구분하려면 기준을 잘 정해야 한다. 하위 호환이 가능하다 * 수정한 js, css의 내용이 구버전과 신버전이 호환이 가능하다면 쿼리스트링으로 충분하기도 하다. 하위 호환이 불가능하다면 무조건 새로운 버전의 js, css가 필요하기 때문에 다른 디렉토리에 새로운 js, css를 복사해야하며 클라이언트가 새로운 파일을 받도록 쿼리스트링을 붙인다. 즉, 새로 WAS 배포시 쿼리스트링(필수) + 정적 파일 버전 업(옵션) 이라고 생각하면 될 것 같다.","categories":[{"name":"Spring Framework","slug":"Spring-Framework","permalink":"http://monibu1548.github.io/categories/Spring-Framework/"}],"tags":[{"name":"스프링 프레임워크","slug":"스프링-프레임워크","permalink":"http://monibu1548.github.io/tags/스프링-프레임워크/"},{"name":"Spring Framework","slug":"Spring-Framework","permalink":"http://monibu1548.github.io/tags/Spring-Framework/"},{"name":"Web","slug":"Web","permalink":"http://monibu1548.github.io/tags/Web/"},{"name":"웹","slug":"웹","permalink":"http://monibu1548.github.io/tags/웹/"},{"name":"버전 관리","slug":"버전-관리","permalink":"http://monibu1548.github.io/tags/버전-관리/"},{"name":"쿼리스트링","slug":"쿼리스트링","permalink":"http://monibu1548.github.io/tags/쿼리스트링/"}]},{"title":"자바 성능 튜닝 이야기","slug":"javatuning","date":"2017-03-05T05:51:36.000Z","updated":"2018-04-15T05:54:19.322Z","comments":true,"path":"2017/03/05/javatuning/","link":"","permalink":"http://monibu1548.github.io/2017/03/05/javatuning/","excerpt":"Map, Set, List, Queue의 차이점 인터페이스구현 클래스특징MapHashMap TreeMap HashTable PropertiesKey-Value의 쌍으로 이루어진 데이터의 집합. 순서가 없으며 Key의 중복을 허용하지 않음. Value는 중복 가능SetHashSet TreeSet순서가 없는 데이터의 집합. 중복 불허ListLinkedList Stack Vector ArrayList순서가 있는 데이터의 집합, 데이터의 중복 허용QueuePriorityQueue ArrayDequeue구조의 양쪽 단에서만 저장/접근할 수","text":"Map, Set, List, Queue의 차이점 인터페이스 구현 클래스 특징 Map HashMapTreeMapHashTableProperties Key-Value의 쌍으로 이루어진 데이터의 집합. 순서가 없으며 Key의 중복을 허용하지 않음. Value는 중복 가능 Set HashSetTreeSet 순서가 없는 데이터의 집합. 중복 불허 List LinkedListStackVectorArrayList 순서가 있는 데이터의 집합, 데이터의 중복 허용 Queue PriorityQueueArrayDequeue 구조의 양쪽 단에서만 저장/접근할 수 있는 구조 Reflection API를 이용하여 매개변수로 넘어온 클래스의 종류 및 메소드 목록을 출력하는 메소드12345678910111213141516171819202122public void printClassInfo(Object object)&#123; Class c = object.getClass(); String className = c.getName(); String classCanonicalName = c.getCanonicalName(); String classSimpleName= c.getSimpleName(); System.out.println(\"Class name : \" + className); System.out.println(\"Class canonical name : \" + classCanonicalName); System.out.println(\"Class simple name : \" + classSimpleName); Field[] fields = c.getFields(); System.out.println(\"## \" + className + \" fields\"); for (Field field : fields) &#123; System.out.println(field); &#125; System.out.println(\"## \" + className + \" methods\"); Method[] methods = c.getMethods(); for (Method method : methods) &#123; System.out.println(method); &#125;&#125; Java CollectionSAX와 DOM 파서의 특징 및 장단점 DOM SAX 풀네임 Document Object Model Simple Api for XML 설명 XML문서를 트리 구조 형태로 Access 할 수 있게 해주는 API 자료구조를 만들지 않고 XML문서를 스캔하면서 순차적으로 이벤트를 발생시켜 XML문서에 접근하게 하는 API 파싱 방법 Tree-Working 기반 Event 기반 처리 방법 메모리에 Tree 형태로 구조화 순차적 이벤트 발생 처리 |장점| 1. 문서 구조의 동적 변경 용이 2. 문서 생성, 편집 가능 3. 복잡한 처리 연산에 유리 | 1. 메모리 효율적 사용 2. 단순/속도 빠름 3. XML 문서 크기에 무관 ||단점| 1. 메모리 사용량 많음 2. 처리속도 느림 | 1. 문서 생성, 편집 불가 (Read 전용) ||접근 방식|Random Acecss|Streaming| 참조 XML파싱 + DOM과 SAX의 차이 http://humble.tistory.com/23 DOM과 SAX을 비교하여 설명 http://i-bada.blogspot.kr/2012/05/dom-sax.html JMX ?JMX (Java Management Extensions)어플리케이션과 서비스를 관리하고 감시하기 위한 표준 자바 기반의 어플리케이션을 모니터링하고 관리하는 기능을 제공 JSR 3 (Spec.) &amp; JSR 160 (Remote API) 에서 정의 J2SE 5.0부터 플랫폼에 포함 참조 JMX 기초 http://blog.naver.com/PostView.nhn?blogId=ypark197&amp;logNo=90092368663 JMX를 모니터링 할 수 있는 도구VisualVMVisualVM JConsoleJConsole JManageJManage Web access log 패턴 분석httpd.conf 의 Log format 설정 표현문자 설명 %i 헤더의 내용 %l 원격 로그인명 %u 원격 사용자 %t common log format 시간 형식의 시간 %r 요청의 첫번째 줄 %s status %b Http 헤더를 제외한 전송 바이트 수, ‘0’은 ‘-‘로 표시 %D 요청을 처리하는데 걸린 시간 (마이크로초 단위) %T 요청을 처리하는데 걸린 시간 (초 단위) 자바 GC 종류Serial CollectorParallel CollectorParallel Compacting CollectorConcurrnt Mark-Sweep ControllerGarbage First Controller참조 Garbage Collection -part 2 http://blog.embian.com/68 GC 상황을 모니터링할 수 있는 도구jstatjstat GCViewerGCViewer GC AnalyzerGC Analyzer JMH를 사용하여 Java SE에 있는 List를 구현한 클래스들의 추가/조회/삭제 기능의 성능을 비교 JMH를 사용하여 Java SE에 있는 Map를 구현한 클래스들의 추가/조회/삭제 기능의 성능을 비교","categories":[{"name":"Java","slug":"Java","permalink":"http://monibu1548.github.io/categories/Java/"}],"tags":[{"name":"java","slug":"java","permalink":"http://monibu1548.github.io/tags/java/"},{"name":"성능 튜닝","slug":"성능-튜닝","permalink":"http://monibu1548.github.io/tags/성능-튜닝/"}]},{"title":"오픈소스 Grafana와 InfluxDB를 활용한 서버 모니터링","slug":"grafana","date":"2017-03-03T05:08:38.000Z","updated":"2018-04-25T14:26:16.684Z","comments":true,"path":"2017/03/03/grafana/","link":"","permalink":"http://monibu1548.github.io/2017/03/03/grafana/","excerpt":"오픈소스 Grafana와 InfluxDB를 활용한 서버 모니터링 왜 쓰는가? 서버의 리소스 (CPU 사용량 및 메모리 사용량)이나 웹 사이트 URL의 호출 횟수, 응답시간 등 서버 개발자가 실시간 모니터링해야 하는 자원을 쉽게 모아서 실시간으로 보여줄 수 있다. 간단한 사용 후기로는 Grafana가 그래프를 그려주는게 InfluxDB에 있는 데이터를 가져와서 그려준다. 그릴 데이터를 sql 쿼리로 가져온다. 신기하다!! 물론 DB는 InfluxDB외에도 다른 Plugin을 통해 가져올 수 있다. Grafana는? 서버 모니터링","text":"오픈소스 Grafana와 InfluxDB를 활용한 서버 모니터링왜 쓰는가?서버의 리소스 (CPU 사용량 및 메모리 사용량)이나 웹 사이트 URL의 호출 횟수, 응답시간 등 서버 개발자가 실시간 모니터링해야 하는 자원을 쉽게 모아서 실시간으로 보여줄 수 있다. 간단한 사용 후기로는 Grafana가 그래프를 그려주는게 InfluxDB에 있는 데이터를 가져와서 그려준다. 그릴 데이터를 sql 쿼리로 가져온다. 신기하다!! 물론 DB는 InfluxDB외에도 다른 Plugin을 통해 가져올 수 있다. Grafana는?서버 모니터링 대시보드 오픈소스. 이런식으로 그려준다.! 얼마나 아름다운가! 시간대 별로. DB에서 사용자 쿼리에 의해 얻어진 데이터로 자동으로 그려준다. Go와 Nodejs 디펜던시를 갖고있다. InfluxDB는?시계열(Time-series) DB. 시계열 데이터란 시간의 흐름에 따라 저장하는 데이터로 서버 환경에서 각종 지표를 수집하는 목적으로 사용한다. http protocol을 이용해 외부에서 제어도 가능하며 표준 SQL을 통해 데이터를 다룰 수 있다. 시작은 설치로부터!Grafana 설치 centos6 기준으로 설치한 내용입니다. 모든 설치는 패키지를 사용하지 않고 portable로 진행합니다. Go 디펜던시 설치go 다운로드 페이지 https://golang.org/dl/ 서버환경에 맞는 tar.gz 파일을 받고 tar로 압축을 해제한다. GOPATH와 GOROOT 환경변수를 설정해야합니다. GOPATH는 GO에서 받는 데이터를 보관할 장소. ~/grafana 를 만들고 이곳으로 설정했습니다. GOROOT는 다운받은 go의 홈디렉토리입니다. /.bashrc 에 다음과 같은 내용을 추가합니다. 1234export GOPATH='/&#123;home&#125;/&#123;username&#125;/grafana'export GOROOT='/&#123;다운 받은 go 위치&#125;' 그리고 수정한 .bashrc를 적용합니다. 12source .bashrc 그 후 grafana source 를 다운로드합니다. 12go get github.com/grafana/grafana 그러면 $GOPATH에 grafana 디렉토리가 생긴 것을 볼 수 있습니다. 이어서 grafana를 설치하기 전에 nodejs를 설치합니다. nodejs 디펜던시 설치 https://nodejs.org/download/ 위 링크에서 nodejs를 다운받습니다. 최신 버전도 많이 나왔지만 저는 4.7사용.. 서버도 옛날꺼고..파이썬도 옛날거고…. node만 최신이면 꼬일것 같은 기분! node도 환경변수로 등록해서 터미널에서 node를 입력했을 때 node 가 바로 실행되어야 합니다. 이제 진짜 grafana 설치 일단 go를 이용해 grafana를 받은 위치로 이동하고 설치를 시작합니다. 123456cd $GOPATH/src/github.com/grafana/grafanago run build.go setupgo run build.go build 이제 여기까지 grafana의 설치가 끝났습니다!!!는 Back-end만.. 이대로 실행하면 Front-end 와장창 이제 grunt로 Front-end를 가져옵니다. 12345678npm install -g yarnyarn install --pure-lockfilenpm install -g grunt-cligrunt 이제 진짜 설치 끝!!! grafana 디렉토리의 ./bin/grafana-server 를 실행시킵니다. 그러면 기본적으로 3000번 포트로 구동되며. http://localhost:3000 로 접근해서 확인할 수 있습니다. 일단 다른 프로그램이 3000번을 잡고있으면 안된다! 정말 설치만 하고 실행했다. 설정파일을 통해 admin 계정 등 보안을 위해 많은 설정이 필요하다 InfluxDB 설치이제 데이터를 예쁘게 그려줄 대쉬보드를 설치했으니 데이터를 저장할 DB를 설치해야한다. 123wget https://dl.influxdata.com/influxdb/releases/influxdb-1.2.0_linux_amd64.tar.gztar xvfz influxdb-1.2.0_linux_amd64.tar.gz 2017-03-03일 기준이므로 https://portal.influxdata.com/downloads#influxdb 에서 최신버전을 확인하고 설치하는 것을 추천. Standalone 으로!!!! 다운로드가 완료되면 influxdb 하위 ./usr/bin 의 influxd를 실행한다 influxd 가 influxDB 데몬이며 influx 는 influxDB 의 cli 클라이언트다. Grafana와 InfluxDB 연동하기가장 어려운 부분이었다. Grafana 페이지. localhost:3000 에서 설정한다. 로그인을 해야한다면 기본 id는 admin, 기본 pw도 admin 이다. 이제 Grafana 페이지의 DataSource메뉴에서 InfluxDB를 연결한다. ip와 포트를 연결하고 Save&amp;Test 버튼을 누른다. 연결이 되었는지 안되었는지는 알려준다!! 초록불이 뜰때까지 정보들을 맞게 수정한다!! Grafana에서 그래프 그리기쉽다. Dashboard 추가. 그래프 추가 각 축에 쿼리문 작성 TIP. add query로 쿼리 추가해서 막 블록형태로 쿼리를 만든다.. 이거 쓰지말자.. 잘 안된다.쿼리 쓰는데 옆에보면 햄버거 버튼이 있다. Toggle custom query를 통해 직접 query를 작성하자. 이렇게 해서 나온 내 서비스의 모니터링 페이지!! 후기Grafana와 InfluxDB를 설치하고 그래프를 그리기까지 2~3일 삽질은 해야하지 않을까 생각했었다. 둘 다 처음사용해보는데다가 디펜던시가 몇가지 있어서 어디선가 터질꺼라 생각했다..! But 설치까지는 1시간만에 끝나버렸다.. 문제는 설치보다 grafana 대시보드 구성과 시계열 데이터에 대한 이해! sql 을 이용해 그래프를 그린다는게 생각하기 힘들었다. 또 시계열 데이터를 어떻게 그려야 원하는 그래프가 나오는지 어렵다 ㅠㅜ. grafana에 아쉬운점은 그래프 Scale 을 조절하기 힘들다는 것! 마우스를 이용해 끄적끄적하면 그래프도 좌우로 이동되고 Zoom in out도 되면 좋겠다!!!! 있는 기능인데 발견을 못한 것일수도! 좀 더 능숙하게 쓸 수 있도록 이것저것 해봐야겠다","categories":[{"name":"ETC","slug":"ETC","permalink":"http://monibu1548.github.io/categories/ETC/"}],"tags":[{"name":"grafana","slug":"grafana","permalink":"http://monibu1548.github.io/tags/grafana/"},{"name":"influxDB","slug":"influxDB","permalink":"http://monibu1548.github.io/tags/influxDB/"},{"name":"모니터링","slug":"모니터링","permalink":"http://monibu1548.github.io/tags/모니터링/"}]},{"title":"웹 최적화 (Apache mod_deflate 모듈을 이용한 압축 전송)","slug":"web-optimize-2","date":"2017-03-01T05:34:28.000Z","updated":"2018-04-15T05:38:10.756Z","comments":true,"path":"2017/03/01/web-optimize-2/","link":"","permalink":"http://monibu1548.github.io/2017/03/01/web-optimize-2/","excerpt":"Apache mod_deflate 모듈을 이용한 압축 전송 지난번 WAS와 WEB의 분리를 통해 js, css 등의 정적 파일은 apache에서 서비스 하도록 변경했다. js, css등의 파일을 압축 전송하여 좀 더 빠르게 사용자에게 전송할 수 있다. 물론 장단점이 존재한다. 장점 : 압축전송으로 인해 좀 더 빠른 전송, 적은 네트워크 트래픽 단점 : 보낼때마다 서버의 압축과정 => 부하 가능성, 브라우저는 받아서 압축 해제해야 하는 추가 과정 필요 mod_deflate gzip 압축전송을 하기 위해서는 apache의 mod","text":"Apache mod_deflate 모듈을 이용한 압축 전송지난번 WAS와 WEB의 분리를 통해 js, css 등의 정적 파일은 apache에서 서비스 하도록 변경했다. js, css등의 파일을 압축 전송하여 좀 더 빠르게 사용자에게 전송할 수 있다. 물론 장단점이 존재한다. 장점 : 압축전송으로 인해 좀 더 빠른 전송, 적은 네트워크 트래픽단점 : 보낼때마다 서버의 압축과정 =&gt; 부하 가능성, 브라우저는 받아서 압축 해제해야 하는 추가 과정 필요 mod_deflategzip 압축전송을 하기 위해서는 apache의 mod_deflate 모듈을 사용한다. mod_deflate모듈은 apache 2.2 버전부터 기본으로 포함되어있다. 그래도 혹시모르니 httpd.conf 에서 확인해보자. apache/conf/httpd.conf 역시 기본으로 LoadModule하고 있다 모듈 설정이제 어떤 파일을 압축할지, 얼마나 압축할지 등의 상세 설정이 필요하다. httpd.conf에서 설정해도 되며 별도의 파일로도 분리 가능하다. 일단 같은 파일에 작성! AddOutputFilterByType DEFLATE {압축할 content type} DeflateCompressionLevel : 압축률, 높을수록 많이 압축한다 BrowerMatch : gzip를 받아주는 브라우저도 있고 안받아주는 브라우저도 있다. 그에 관련된 설정 SetEnvIfNoCase Request_URI {파일확장자 정규표현식} {환경변수..} : 해당 파일확장자에 대한 요청이 오면 환경변수들을 설정한다. 여기서 NoCase는 대소문자를 가리지 않겠다는 의미 DefalteFilterNote Input : 로그 관련, 원본 파일 크기 DefalteFilterNote Output : 로그 관련, 압축된 파일 크기 DeflateFilterNote Ratio : 로그 관련, 압축 비율 LogFormat : 로그 관련, 로그 출력 형태 지정 압축이 돼서 오는지 확인해보자일단!! 현재 압축 전송이 되고 있나 확인해보자!크롬 개발자도구에서 “Network” 탭을 열고 Ctrl + Shift + F5 를 눌러서 강력 새로고침을 누르면 js, css등 많은 파일을 받는 것을 볼 수 있다. Requst Headers를 보면 Content-Encoding에 gzip이 표시되는 것을 확인할 수 있다. 만약 mod_deflate를 사용하지 않았다면?? httpd.conf에서 LoadModule mod_deflate.so를 주석처리하고 apache를 재실행하고 다시 페이지를 로드하면 mod_deflate를 사용하기 이전에는 그냥 js파일이 생으로 날라오고 있었다는 것을 확인할 수 있다. 실제로 압축이 얼마나 돼서 전송될까??mod_deflate의 로그 파일을 통해 알아볼 수 있다. virtual host에 CustomLog를 추가한다. 웹 페이지에 접속하여 apache가 파일 전송을 위해 압축을 하게되면 deflate.log가 쌓이는 것을 볼 수 있다. 내용을 살펴보면 다음과 같다. {HTTP method} {파일경로} {HTTP 버전} {압축 후 크기 / 압축 전 크기} {압축률} 압축률을 9로 설정해서 그런지 상당히 많이 압축된다. 참고사항 사실 js와 css를 gzip하는거보다 minify하는게 더 효과적이라고 한다 png, pdf 등의 파일은 이미 압축되어 있어서 압축하지 말아야 한다 아주 적은 json 또는 text를 반환하는 경우 압축하지 않는 것이 좋다.","categories":[{"name":"Spring Framework","slug":"Spring-Framework","permalink":"http://monibu1548.github.io/categories/Spring-Framework/"}],"tags":[{"name":"스프링 프레임워크","slug":"스프링-프레임워크","permalink":"http://monibu1548.github.io/tags/스프링-프레임워크/"},{"name":"Spring Framework","slug":"Spring-Framework","permalink":"http://monibu1548.github.io/tags/Spring-Framework/"},{"name":"Web","slug":"Web","permalink":"http://monibu1548.github.io/tags/Web/"},{"name":"웹","slug":"웹","permalink":"http://monibu1548.github.io/tags/웹/"},{"name":"최적화","slug":"최적화","permalink":"http://monibu1548.github.io/tags/최적화/"}]},{"title":"웹 최적화 (WEB과 WAS의 분리)","slug":"web-optimize-1","date":"2017-02-26T05:32:07.000Z","updated":"2018-04-15T05:35:52.690Z","comments":true,"path":"2017/02/26/web-optimize-1/","link":"","permalink":"http://monibu1548.github.io/2017/02/26/web-optimize-1/","excerpt":"WEB과 WAS의 분리, (Apache와 Tomcat 분리) Apache (웹 서버) 는 static한 파일 (js, img, css) 등 변동이 없는 파일을 서비스하기 위해 사용되어 왔다. Tomcat (웹 어플리케이션 서버, 이하 WAS) 는 사용자의 요청 등에 따라 유동적인 서비스를 제공하기 위해 사용한다. WEB은 static 파일 서비스에 유리하고, WAS는 동적인 서비스를 제공하는데 유리하다. 현재까지 구현한 웹 서비스에서는 WEB은 WAS로 proxy 기능만 하고있다. 즉 WEB의 장점을 사용하지 못하고 있었다.","text":"WEB과 WAS의 분리, (Apache와 Tomcat 분리)Apache (웹 서버) 는 static한 파일 (js, img, css) 등 변동이 없는 파일을 서비스하기 위해 사용되어 왔다. Tomcat (웹 어플리케이션 서버, 이하 WAS) 는 사용자의 요청 등에 따라 유동적인 서비스를 제공하기 위해 사용한다. WEB은 static 파일 서비스에 유리하고, WAS는 동적인 서비스를 제공하는데 유리하다. 현재까지 구현한 웹 서비스에서는 WEB은 WAS로 proxy 기능만 하고있다. 즉 WEB의 장점을 사용하지 못하고 있었다. 구글신에게 WAS와 WEB의 분리라는 키워드로 두시간 정도 검색하고 자료를 모아본 결과 크게 2가지 결론을 구할 수 있었다. apache의 mod_jk를 이용한 정적 파일 서비스 mod_jk 설정에서 어떤 url을 was로 던질지 결정한다. 즉 was에서 처리해야 할 것만 was로 던지고 나머지는 apache가 처리한다. 여기서 흥미로웠던 사실! .nhn .do 등 url에 이상한 확장자 느낌? 으로 사용하는 웹 서비스들을 자주 봐왔다. 저게 뭔가 했더니 알고보니 mod_jk 설정에 의해 WAS로 처리하라는 명시적인 기호였다. apache의 mod_proxy를 이용한 정적 파일 서비스 별도의 CDN이나 정적 파일 서버가 존재할 때 유용한 방법이다. /static 또는 /content 등 정적파일용 uri router를 만들고 해당 url로 접근시 정적 파일 서버로 proxy 하는 방법으로 사용할 수 있다. 내가 내린 결론 어렵지 않아야 한다=&gt; 메이븐 라이프 사이클에 끝나야 한다. 메이븐 라이프 사이클 밖에서 파일을 옮기고 하는 작업은 다른 서버에서는 어떻게 동작할지 확신할 수 없으니 최대한 피해야 한다. 이런 고민을 통해 다음과 같은 결과를 얻을 수 있었다. httpd.conf 에서 Proxy만 잘 하면 war파일 상태 그대로 js, css만 apache가 서비스할 수 있을 것이다. 이게 고민 끝에 내린 답. ProxyPass를 보면 ROOT 로 접근하면 127.0.0.1:9001, 즉 WAS 서비스 포트로 Proxy한다. resources/img 로 접근하면 proxy를 사용하지 않겠다는 “!” 가 있다. 마찬가지로 resources/js resources/css 도 proxy 를 사용하지 않는다는 뜻이다. proxy를 사용하지 않는다는 것은 apache의 DocumentRoot 로 부터 파일을 찾게 한다는 뜻이다. DocumentRoot를 현재 서비스하고 있는 war의 디렉토리로 설정하면 proxy를 제거한 부분은 apache가 서비스 하게 된다. 경로를 끼워맞추는 느낌? 한번에 잘 될리가 없지브라우저에서 base url을 입력해서 웹 서비스 화면으로 이동해보자. js와 css가 제대로 불러와지고 있나 확인. 크롬 개발자 도구에서 쉽게 볼 수 있다. 403 권한 관련 에러가 발생하는 경우tomcat의 server.xml 설정에 따라 다르겠지만 기본적으로는 ${TOMCAT_HOME}/webapps 디렉토리 밑에 배포가 된다. 서비스하고 있는 디렉토리부터 js, css파일까지의 권한이 없어서 발생하는 문제로 해당 경로를 따라가며 others 가 read, excute 할 수 있는 권한을 준다. 나는 755를 부여했다. 404 Not Found 에러가 발생하는 경우경로문제. 처음부터 다시 경로를 잘 살펴봐야 한다. 이번엔 진짜 잘 되나 보자다시 웹 서비스 화면으로 이동한다. js와 css가 정상적으로 로드되어 문제 없이 서비스 되어야 한다 진짜 잘 된건가? apache가 아니라 그냥 tomcat이 파일 주는거 아냐?원래 WAS로 js, css 줄 때도 잘 됐으니 이 js,css를 apache가 주는건지 tomcat이 주는건지 어떻게 알아. 테스트해보면 알지ex) http://baseurl/resources/img/plus.PNG 내 서비스 경로에는 다음과 같은 이미지 하나가 있다. 접속해보면 이미지가 잘 나온다. 이제 파일명을 이상하게 수정해보자. 없는 파일로! 에러메세지를 볼꺼니까! ex) http://baseurl/resources/img/plus-hahahahahahhahahahahah.PNG 이런 에러 화면을 볼 수 있다. 웹 개발하면서 자주 보던 톰캣의 Internal server 500 error 화면이랑 다르다는걸 느껴야한다! 얘는 apache가 주는 에러창이니까!! apache가 이 파일을 찾고 있다!!! 잘 되고 있다!! 만약 proxy 설정이 잘못되어 WAS가 아직도 static 파일을 서비스 하고 있었다면 이 에러페이지는 tomcat의 404 에러 메세지가 떴을것이다. 이런식으로 이로써 WAS와 WEB이 각자 제 역할을 부여받았다. 곧 업데이트할 웹 최적화 시리즈 정적 파일 배포 버전관리 쿼리스트링을 이용한 웹 캐싱 방지","categories":[{"name":"Spring Framework","slug":"Spring-Framework","permalink":"http://monibu1548.github.io/categories/Spring-Framework/"}],"tags":[{"name":"스프링 프레임워크","slug":"스프링-프레임워크","permalink":"http://monibu1548.github.io/tags/스프링-프레임워크/"},{"name":"Spring Framework","slug":"Spring-Framework","permalink":"http://monibu1548.github.io/tags/Spring-Framework/"},{"name":"Web","slug":"Web","permalink":"http://monibu1548.github.io/tags/Web/"},{"name":"웹","slug":"웹","permalink":"http://monibu1548.github.io/tags/웹/"},{"name":"최적화","slug":"최적화","permalink":"http://monibu1548.github.io/tags/최적화/"}]},{"title":"Jasypt를 이용한 properties 암호화 spring4","slug":"jasypt","date":"2017-02-09T05:43:00.000Z","updated":"2018-04-15T05:45:51.522Z","comments":true,"path":"2017/02/09/jasypt/","link":"","permalink":"http://monibu1548.github.io/2017/02/09/jasypt/","excerpt":"Github 또는 그 외의 공개 장소에 프로젝트 관리를 하다보면 DB 패스워드 등 보안에 민감한 정보들이 노출되기 쉽다. 깃헙에 delete password 라는 키워드로 커밋 검색 결과… delete password 커밋해도.. 이전 커밋에는 패스워드가 노출되어있다는 것.. 애초에 올리질 말아야 한다 그 외에 OAuth에 필요한 키, 다른 API 토큰들 이런 정보는 보호해야 한다. 하지만 문제가 되는 부분인 협업을 하면서 민감한 정보들만 보호하면서 공유해야한다는 것이다. 지금까지는 해당 설정파일을 따로 만들고 설정파일만","text":"Github 또는 그 외의 공개 장소에 프로젝트 관리를 하다보면 DB 패스워드 등 보안에 민감한 정보들이 노출되기 쉽다. 깃헙에 delete password 라는 키워드로 커밋 검색 결과… delete password 커밋해도.. 이전 커밋에는 패스워드가 노출되어있다는 것.. 애초에 올리질 말아야 한다 그 외에 OAuth에 필요한 키, 다른 API 토큰들 이런 정보는 보호해야 한다. 하지만 문제가 되는 부분인 협업을 하면서 민감한 정보들만 보호하면서 공유해야한다는 것이다. 지금까지는 해당 설정파일을 따로 만들고 설정파일만 메신저로 공유하며 Github에는 설정파일을 제외한 정보들만 올리는 방법을 사용했다. 이번 기회에 제대로 된 정석적인 방법을 구글링 했고 몇가지 키워드를 얻을 수 있었다. Maven의 pom 암호화 기능. pom.xml에 민감한 정보가 들어가야 할 때, 예를 들면 deploy 타이밍에 서버 계정이 들어가야 하는데 이 부분을 암호화 할 수 있도록 도와준다고 한다. 내가 찾던 properties 암호화는 아니었지만 알아두면 좋을 것 같다. https://maven.apache.org/guides/mini/guide-encryption.html Jasypt 라이브러리 Encrption이라는 키워드로 검색했을 때 Jasypt 라는 라이브러리가 자주 등장했다. 자바에서 암호화를 쉽게 할 수 있도록 도와주는 라이브러리였다. 나는 Spring에서 프로젝트가 실행될 때 암호화를 해제하는걸 원했는데 관련 블로그에서는 java 코드 내에서 암호화, 복호화 하는 내용만 다루고 있었다. Spring Jasypt 역시 Spring에 적용 가능한 Library가 존재했다. 암호화 된 패스워드를 풀기 위한 Key는 각 서버의 환경변수로 보관함으로써 Github에는 암호화 된 프로젝트를 올릴 수 있었다. Jasypt 그 엄청난 삽질기Jasypt 는 꽤 오래된 라이브러리였다. 현재 maven repo에 있는 1.9.2.. 2014년 2월 버전. spring 3.1버전 지원한다고 되어있고 그 이후로는 업뎃이 없었다. 이게 발목을 잡을 줄이야.. Jasypt이 properties를 암호화 하고 사용하는 방식 Tomcat에서 Spring 프로젝트가 올라가면서 context 가 생성된다 그 타이밍에 context에 있는 jasypt 객체들이 암호를 풀어준다. 암호를 풀려면 “키” 가 있어야 한다. 근데 결국 “키” 가 프로젝트 내부에 있으면 보안 없는거나 마찬가지 아닌가? 그래서 그 “키”는 프로젝트 내부가 아니라 구동 서버의 환경변수로 존재한다. 고로 안전하다. Jasypt을 사용해보자maven dependency 설정 pom.xmp 에 Jasypt-spring 라이브러리를 추가한다. 123456&lt;dependency&gt; &lt;groupId&gt;org.jasypt&lt;/groupId&gt; &lt;artifactId&gt;jasypt-spring31&lt;/artifactId&gt; &lt;version&gt;1.9.2&lt;/version&gt; &lt;scope&gt;compile&lt;/scope&gt;&lt;/dependency&gt; 메이븐 레포를 보면 jasypt-spring31, jasypt-spring3 이렇게 두 가지 버전이 있다. jasypt-spring3은 spring 3.0까지 지원하고 그 이후로는 jasypt-spring31이 spring3.1 부터 최신까지 지원한다고 공식 홈페이지에 써있다. Spring 4.3.3 을 쓰는 지금 jasypt-spring31을 사용해서 동작을 확인했다. spring context 설정 context에 복호화를 위한 객체 3개를 bean으로 만들어준다. 1234567891011121314151617181920&lt;beans:bean id=\"encryptorConfig\" class=\"org.jasypt.encryption.pbe.config.EnvironmentPBEConfig\"&gt; &lt;beans:property name=\"algorithm\" value=\"PBEWithMD5AndDES\" /&gt; &lt;beans:property name=\"passwordEnvName\" value=\"ASOG_ENCRYPTION_KEY\" /&gt;&lt;/beans:bean&gt;&lt;beans:bean id=\"encryptor\" class=\"org.jasypt.encryption.pbe.StandardPBEStringEncryptor\"&gt; &lt;beans:property name=\"config\" ref=\"encryptorConfig\" /&gt;&lt;/beans:bean&gt;&lt;beans:bean class=\"org.jasypt.spring31.properties.EncryptablePropertyPlaceholderConfigurer\"&gt; &lt;beans:constructor-arg ref=\"encryptor\" /&gt; &lt;beans:property name=\"locations\"&gt; &lt;beans:list&gt; &lt;beans:value&gt;classpath:config/jdbc/jdbc.properties&lt;/beans:value&gt; &lt;beans:value&gt;classpath:config/oauth/OAuthFacebook.properties&lt;/beans:value&gt; &lt;beans:value&gt;classpath:config/oauth/OAuthPayco.properties&lt;/beans:value&gt; &lt;beans:value&gt;classpath:config/objectstorage/objectstorage.properties&lt;/beans:value&gt; &lt;/beans:list&gt; &lt;/beans:property&gt;&lt;/beans:bean&gt; 이렇게 3가지 bean을 만든다. 1개씩 살펴보자. 1234&lt;beans:bean id=\"encryptorConfig\" class=\"org.jasypt.encryption.pbe.config.EnvironmentPBEConfig\"&gt; &lt;beans:property name=\"algorithm\" value=\"PBEWithMD5AndDES\" /&gt; &lt;beans:property name=\"passwordEnvName\" value=\"ASOG_ENCRYPTION_KEY\" /&gt;&lt;/beans:bean&gt; algorithm암/복호화 알고리즘이다. 암호화 할 때 쓴 알고리즘 이름을 넣어야 한다. 저 필드에 넣을 수 있는 값은 여기에서 볼 수 있다. passwordEnvName환경변수로 지정한 키 값이다. 리눅스 기준 echo $ASOG_ENCRYPTION_KEY 했을 때 출력되는 값을 넣어주는 부분이다. “키” 를 프로젝트 내부가 아닌 외부에 저장하는 방식.당연히 프로젝트 복호화를 위해 서버 bashrc 등 rc 파일에 export ASOG_ENCRYPTION_KEY={진짜 키} 가 되어 있어야 한다. 안그러면 익셉션 발생! 123&lt;beans:bean id=\"encryptor\" class=\"org.jasypt.encryption.pbe.StandardPBEStringEncryptor\"&gt; &lt;beans:property name=\"config\" ref=\"encryptorConfig\" /&gt;&lt;/beans:bean&gt; 여긴 별 거 없다. StandardPBEStringEncryptor PBEEncryptor를 상속받는 다른 클래스도 사용할 수 있다는 거만 알아두자. 1234567891011&lt;beans:bean class=\"org.jasypt.spring31.properties.EncryptablePropertyPlaceholderConfigurer\"&gt; &lt;beans:constructor-arg ref=\"encryptor\" /&gt; &lt;beans:property name=\"locations\"&gt; &lt;beans:list&gt; &lt;beans:value&gt;classpath:config/jdbc/jdbc.properties&lt;/beans:value&gt; &lt;beans:value&gt;classpath:config/oauth/OAuthFacebook.properties&lt;/beans:value&gt; &lt;beans:value&gt;classpath:config/oauth/OAuthPayco.properties&lt;/beans:value&gt; &lt;beans:value&gt;classpath:config/objectstorage/objectstorage.properties&lt;/beans:value&gt; &lt;/beans:list&gt; &lt;/beans:property&gt;&lt;/beans:bean&gt; 이곳에서 암호화 된 값들이 있는 .properties 파일의 위치를 설정한다. 주의해야 할 점이라고 한다면 bean class 부분을 보면 얘만 spring31 패키지에 포함되어있다는 것 삽질한 부분 properties 파일은 다음과 같이 생겼다. 그리고 사용하는 부분은 context.xml의 경우 다음과 같다. 현재 잘 구동되는 코드.. 그리고 이제 다음에 안돌아 가던 코드.. 차이점… value에서 “#” 을 이용해서 가져오느냐 “$”를 이용해서 가져오느냐의 차이.. 과거에는 “$”를 이용해서 properties를 가져오는 방식을 많이 사용했다고 한다. 이 경우 각 프로퍼티 파일들이 하나로 인식되어 다른 파일에 같은 프로퍼티가 있을경우 중복되어 에러 발생가능성이 있다고 한다. 그래서 언제부터인지는 모르겠지만 “#” 키워드를 이용해 파일마다 id를 부여하여 이런 문제를 겪지 않도록 한다고 한다. “#”이라고 하면 jasypt가 복호화 안해준다. jar파일 디버깅까지 하면서 찾은 결과.. “$” 방식으로 프로퍼티를 읽어야 jasypt가 복호화 해준다..ㄷㄷ “#”이 최신방식이라고 했는데!! 아마 jasypt가 옛날 라이브러리라 그런가 싶다. 그래서 암호화는 어떻게 하냐고?유틸리티를 다운받는다 bat, sh 로 제공되어 윈도우, 맥, 서버환경 모두 사용 가능하다. http://www.jasypt.org/download.html 다운받고 압축을 풀고 bin 디렉토리에 들어가보면 이렇게 생겼다. 구성품 encrypt.sh : 암호화 툴 decrypt.sh : 복호화 툴 digest.sh : 모르겠음, 사용안함 listAlgorithms : 사용 가능한 암복호화 알고리즘 리스트 보여줌 encrypt로 암호화 해보자 일단 그냥 encrypt.sh를 실행해보자 친절하게 사용법을 알려준다. 그럼 알려준대로 실행해보자 OUTPUT 나온 값을 이제 properties 파일에 써준다. ENC(OUTPUT나온 값) 이렇게 써야 한다. 주의할 점 input과 password 필드가 있다. input이 암호화 할 대상이고 password는 대칭키다. 헷갈리면 안된다. 다시 input은 실제 DB비번 등 암호화 해야 하는 대상. password는 환경변수로 갖고 있어야 할 키. 참고이클립스에서 환경변수 값을 못읽는다? eclipse에서는 환경변수 못 읽는다. 검색해봤는데 영어로 어렵게 설명해준다. 결론은 project -&gt; run configuration 에 들어가면 직접 환경변수 설정할 수 있다는 것이다. jasypt 에서 not operation exception 발생하는 경우무슨 정책 때문에 그렇다고 한다. 오라클 홈페이지 가서 자신이 사용하는 JDK 버전에 맞춰서 JCE 다운받아서 덮어씌우라고 한다. 나는 이 경우가 없어서 사용하진 않았지만 혹시몰라서 메모!","categories":[{"name":"Spring Framework","slug":"Spring-Framework","permalink":"http://monibu1548.github.io/categories/Spring-Framework/"}],"tags":[{"name":"Jasypt","slug":"Jasypt","permalink":"http://monibu1548.github.io/tags/Jasypt/"},{"name":"스프링 프레임워크","slug":"스프링-프레임워크","permalink":"http://monibu1548.github.io/tags/스프링-프레임워크/"},{"name":"Spring Framework","slug":"Spring-Framework","permalink":"http://monibu1548.github.io/tags/Spring-Framework/"}]},{"title":"WAR(웹 어플리케이션) 배포","slug":"web-deploy","date":"2017-01-22T06:04:50.000Z","updated":"2018-04-15T06:06:16.619Z","comments":true,"path":"2017/01/22/web-deploy/","link":"","permalink":"http://monibu1548.github.io/2017/01/22/web-deploy/","excerpt":"Tomcat의 주요 디렉토리 구조 디렉토리설명bintomcat 실행에 필요한 바이너리conf설정파일","text":"Tomcat의 주요 디렉토리 구조 디렉토리 설명 bin tomcat 실행에 필요한 바이너리 conf 설정파일 &lt;- 중요하다!! webapps 웹앱들의 루트 폴더 work jsp파일을 서블릿 형태로 변환한 java파일 톰캣 환경설정 ( server.xml ) server.xml 을 보면 몇가지 태그로 정보를 구분할 수 있다. 태그 설명 Service tomcat의 구성요소를 정의한다. 기본적으로 Catalina로 되어 있다 Connector 서비스 요청이 왔을 때 Engine에게 넘겨주는 역할. 포트번호와 프로토콜을 설정한다 Engine servlet의 인스턴스 단위. Engine으로부터 넘겨받은 요청을 처리하는 단위 Host Engine에 관련된 가상호스트를 정의한다. 호스트 이름이 무엇인지, war파일의 기본 디렉토리 등의 설정이 가능하다 Host Engine에 관련된 가상호스트를 정의한다. 호스트 이름이 무엇인지, war파일의 기본 디렉토리 등의 설정이 가능하다. 개인적으로 가장 중요한 부분이라고 생각한다 WARmvn package 명령어를 통해 프로젝트의 WAR파일을 생성할 수 있다. WAR파일의 이름은 [프로젝트명]-버전-빌드-스냅샷.war 로 매우 길다. 하지만 tomcat 경로에 배치할 때는 줄이겠지 당연히!!pom.xml에서 mvn package의 결과로 생성할 WAR파일의 이름을 미리 지정할 수 있으니 알아두는 것이 좋을것 같다. 주의해야 할 사항간혹 소스코드 내에 host를 포함한 상대 경로가 들어가는 경우가 있다. server.xml 설정에 따라 다르겠지만 http://localhost/project/ 가 될 수도 있고 http://localhost/ 로 끝나는 경우도 있다. 이 경우에 따라 프로젝트가 정상적으로 실행되지 않을 수 있으니 참고!!!!!! [출처] http://okky.kr/article/115423 [출처] http://jang8584.tistory.com/72","categories":[{"name":"Spring Framework","slug":"Spring-Framework","permalink":"http://monibu1548.github.io/categories/Spring-Framework/"}],"tags":[{"name":"스프링 프레임워크","slug":"스프링-프레임워크","permalink":"http://monibu1548.github.io/tags/스프링-프레임워크/"},{"name":"Spring Framework","slug":"Spring-Framework","permalink":"http://monibu1548.github.io/tags/Spring-Framework/"},{"name":"Web","slug":"Web","permalink":"http://monibu1548.github.io/tags/Web/"},{"name":"웹","slug":"웹","permalink":"http://monibu1548.github.io/tags/웹/"},{"name":"배포","slug":"배포","permalink":"http://monibu1548.github.io/tags/배포/"}]},{"title":"NHN 토스트루키 기술교육 2주차 회고","slug":"rooke2week","date":"2017-01-22T05:04:30.000Z","updated":"2018-04-15T05:27:43.484Z","comments":true,"path":"2017/01/22/rooke2week/","link":"","permalink":"http://monibu1548.github.io/2017/01/22/rooke2week/","excerpt":"Toast-Rookie 기술교육 2주차 투표 서비스 ‘신의 한 수’ 개발 시작 2주차부터 본격적으로 개발을 시작했다. git이나 태스크 관리 등 규칙 정하는데 하루를 모두 소비했다. 그 후 Repo 등록하고 Spring Framework프로젝트 생성 후 첫 Initial Commit을 날렸다. 2주차에는 DB -> DAO -> Service 까지 개발하기로 했다. 그래야 다음주에 UI를 할 수 있으니.. 2주차가 끝나는 오늘 아직 Service가 개발중이다. 중간에 DB를 갈아엎은게 영향이 컸다. 방명록 이후의 spring Jav","text":"Toast-Rookie 기술교육 2주차투표 서비스 ‘신의 한 수’ 개발 시작2주차부터 본격적으로 개발을 시작했다. git이나 태스크 관리 등 규칙 정하는데 하루를 모두 소비했다. 그 후 Repo 등록하고 Spring Framework프로젝트 생성 후 첫 Initial Commit을 날렸다.2주차에는 DB -&gt; DAO -&gt; Service 까지 개발하기로 했다. 그래야 다음주에 UI를 할 수 있으니..2주차가 끝나는 오늘 아직 Service가 개발중이다. 중간에 DB를 갈아엎은게 영향이 컸다. 방명록 이후의 springJava는 안드로이드로만 접했고 웹은 node로만 했었는데.. 생소한 Spring Framework로 자바웹을 하게 될 줄이야…그나마 사전과제 방명록 개발하면서 Spring에 익숙해진 덕분에 초기 개발환경 설정이나 구조를 이해하는데 도움이 많이 되었다. DB 삽질학부 데이터베이스 과목을 열심히 듣지 않았던 것을 매우 후회했다. 결국 DAO, DTO 다 구현해놓고 밤새 갈아엎어버리는 대참사가 발생했다. 프로젝트 개발 전 데이터베이스 검증을 진짜 잘 해야 나중에 고생을 안하겠구나..싶었다. TDD말로만 들었던 TDD을 적용해보기로 했다. Service 레벨에서 각 필요한 기능을 정의하고 해당 기능에서 발생할 수 있는 예외를 미리 예측하고 테스트케이스를 만들어 실제 서비스가 진행될 때 정의되지 않은 예외가 발생할 가능성을 줄일수 있을 것 같다.물론 TDD할 때도 테스트 케이스를 테스트하는 어처구니 없는 삽질을 하고야 말았다. 많이 연습하고 익숙해져야겠다. 토비의 스프링워낙 유명한 책이라 이름은 많이 들어봤지만, 자바웹에는 1도 관심이 없었기에 볼 생각은 한번도 안했다. Spring을 접하면서 읽게 되었는데 스프링 프레임워크에 대한 지식 뿐 아니라 일반적인 Java 개발에 도움이 되는 지식이 정말 많았다. 지금까지 java 개발을 하면서 의문을 가졌던 부분에 대해서 가장 정석적인, 효율적인 방법을 소개해주는게 제일 마음에 들었다. 붕 떠있던 지식들이 용어와 함께 정리되는 느낌! 또한 다른 오픈소스를 보면서 왜 저런구조인지 이해를 못했던 것도 토비의 스프링을 통해 알게 되었다. 예를 들면 Exception 처리를 발생 지점에서 바로 처리할지, 그냥 위로 throw 해버릴지에 대한 고민을 해결했다 ARCUS DB 오픈소스 공부할때 왜 각 Method 단위가 클래스로 되어있었는지.. 알고보니 전략패턴 아직도 남는 의문. 앞으로 해결해야 할 질문들 Spring은 MVC구조로 되어있다. View를 Spring 에서 만들어서 던져준다.. 요즘은 Front에서 ajax로 구현하는 SPA가 많지 않나..? 그런거에는 적합하지 않은 프레임워크인가? Spring 이랑 Catalina. 구조. 동작 순서","categories":[{"name":"NHN ent.","slug":"NHN-ent","permalink":"http://monibu1548.github.io/categories/NHN-ent/"}],"tags":[{"name":"NHN","slug":"NHN","permalink":"http://monibu1548.github.io/tags/NHN/"},{"name":"토스트루키","slug":"토스트루키","permalink":"http://monibu1548.github.io/tags/토스트루키/"},{"name":"기술교육","slug":"기술교육","permalink":"http://monibu1548.github.io/tags/기술교육/"}]},{"title":"Travis CI를 이용한 빌드 테스트","slug":"TravisCI","date":"2017-01-14T04:44:47.000Z","updated":"2018-04-25T14:26:17.214Z","comments":true,"path":"2017/01/14/TravisCI/","link":"","permalink":"http://monibu1548.github.io/2017/01/14/TravisCI/","excerpt":"Travis CI Travis CI 란? Travis CI는 오픈소스 커뮤니티를 위한 지속적 통합 서비스이다. Github의 README.md 파일을 보면 build/passing 같은 뱃지를 볼 수 있다. 이것이 travis의 CI의 결과를 쉽게 알 수 있는 기능이다. Travis CI 서비스 가입하기 * Travis CI 서비스 홈페이지 https://travis-ci.org/ * 서비스 가입은 Github 계정으로만 가입할 수 있다. Repository 연동하기 로그인 후 우측 상단의 계정을 클릭하여 [Accou","text":"Travis CITravis CI 란? Travis CI는 오픈소스 커뮤니티를 위한 지속적 통합 서비스이다. Github의 README.md 파일을 보면 build/passing 같은 뱃지를 볼 수 있다. 이것이 travis의 CI의 결과를 쉽게 알 수 있는 기능이다. Travis CI 서비스 가입하기 Travis CI 서비스 홈페이지 https://travis-ci.org/ 서비스 가입은 Github 계정으로만 가입할 수 있다. Repository 연동하기로그인 후 우측 상단의 계정을 클릭하여 [Account] 메뉴로 진입할 수 있다. 이 페이지에서 본인의 Repository가 체크박스 형태로 나열되어 있으며 CI를 On/Off 할 수 있다. Repository에 .travis.yml 파일이 있어야 한다 .travis.yml .travis.yml 설정 파일을 통해 테스트 환경을 설정할 수 있다. Repository의 가장 최상위 디렉토리에 작성한다. Maven 프로젝트라면 다음과 같은 간단한 .travis.yml로 CI를 연결할 수 있다. 1language: java mvn test 결과에 따라 build 성공 여부를 알려준다 Makefile 스크립트로 테스트 코드를 작성하고 .travis.yml 에서 script: 로 실행하여 다양한 테스트를 진행할 수 있다. Travis Badge 설치하기 대부분의 Github 오픈소스에서 README.md에 build/passing 이라는 초록 뱃지를 볼 수 있다. Travis CI 홈페이지에서 My Repository에 들어가면 레포 이름 옆에 뱃지를 볼 수 있다. 이 뱃지를 클릭하면 [Status Image] 라는 대화상자가 뜨며 이미지의 링크가 뜬다.!! 여기에서 branch 도 설정 가능하다..!! Travis CI를 통해 쉽게 빌드 테스트를 진행할 수 있으며 Branch뿐만 아니라 PR에 대해서도 검사를 진행하므로 더 생산적인 코딩을 할 수 있지 않을까!!!","categories":[{"name":"ETC","slug":"ETC","permalink":"http://monibu1548.github.io/categories/ETC/"}],"tags":[{"name":"CI","slug":"CI","permalink":"http://monibu1548.github.io/tags/CI/"},{"name":"java","slug":"java","permalink":"http://monibu1548.github.io/tags/java/"},{"name":"maven","slug":"maven","permalink":"http://monibu1548.github.io/tags/maven/"},{"name":"jenkins","slug":"jenkins","permalink":"http://monibu1548.github.io/tags/jenkins/"}]}]}